{
  "nodes": [
    {
      "op": "_ones", 
      "name": "largememory0__ones0", 
      "attrs": {
        "dtype": "float32", 
        "shape": "(1, 1, 4)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertmodel0_word_embed_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30522, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertmodel0_word_embed_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "30522", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertmodel0_token_type_embed_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(2, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertmodel0_token_type_embed_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "2", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertmodel0__plus0", 
      "inputs": [[3, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "bertmodel0_transpose0", 
      "attrs": {"axes": "(1, 0, 2)"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "_contrib_arange_like", 
      "name": "bertencoder0_arange_like0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_position_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "bertencoder0_embedding0", 
      "attrs": {
        "input_dim": "512", 
        "output_dim": "768"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "bertencoder0_broadcast_add1", 
      "inputs": [[8, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_reshape0", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_reshape2", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_concat0", 
      "attrs": {
        "dim": "-2", 
        "num_args": "3"
      }, 
      "inputs": [[19, 0, 0], [21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_concat1", 
      "attrs": {
        "dim": "0", 
        "num_args": "3"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[17, 0, 0], [25, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_qk", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_interleaved_matmul_selfatt_qk0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "extendedbert0_reshape0", 
      "attrs": {"shape": "(-1,)"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape0", 
      "attrs": {"shape": "(-1, 1)"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "zeros_like", 
      "name": "bertencoder0_zeros_like0", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_reshape1", 
      "attrs": {"shape": "(1, -1)"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "broadcast_add", 
      "name": "bertencoder0_broadcast_add0", 
      "inputs": [[34, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "bertencoder0_cast0", 
      "attrs": {"dtype": "int32"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_softmax0", 
      "attrs": {
        "axis": "-1", 
        "use_length": "True"
      }, 
      "inputs": [[31, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_valatt", 
      "name": "bertencoder0_transformer0_dotproductselfattentioncell0_interleaved_matmul_selfatt_valatt0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[30, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0], [46, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer0__plus0", 
      "inputs": [[48, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "bertencoder0_transformer0_positionwiseffn0_gelu0_leakyrelu0", 
      "attrs": {"act_type": "gelu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer0_positionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer0_positionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer0_positionwiseffn0__plus0", 
      "inputs": [[60, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer0_positionwiseffn0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer0_positionwiseffn0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_reshape0", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_reshape2", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_concat0", 
      "attrs": {
        "dim": "-2", 
        "num_args": "3"
      }, 
      "inputs": [[66, 0, 0], [68, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_concat1", 
      "attrs": {
        "dim": "0", 
        "num_args": "3"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[64, 0, 0], [72, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_qk", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_interleaved_matmul_selfatt_qk0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_softmax0", 
      "attrs": {
        "axis": "-1", 
        "use_length": "True"
      }, 
      "inputs": [[78, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_valatt", 
      "name": "bertencoder0_transformer1_dotproductselfattentioncell0_interleaved_matmul_selfatt_valatt0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[77, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[84, 0, 0], [85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer1__plus0", 
      "inputs": [[88, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer1_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[92, 0, 0], [93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "bertencoder0_transformer1_positionwiseffn0_gelu0_leakyrelu0", 
      "attrs": {"act_type": "gelu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer1_positionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer1_positionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer1_positionwiseffn0__plus0", 
      "inputs": [[100, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer1_positionwiseffn0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer1_positionwiseffn0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[101, 0, 0], [102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_reshape0", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_reshape2", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_concat0", 
      "attrs": {
        "dim": "-2", 
        "num_args": "3"
      }, 
      "inputs": [[106, 0, 0], [108, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_concat1", 
      "attrs": {
        "dim": "0", 
        "num_args": "3"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0], [115, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[104, 0, 0], [112, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_qk", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_interleaved_matmul_selfatt_qk0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_softmax0", 
      "attrs": {
        "axis": "-1", 
        "use_length": "True"
      }, 
      "inputs": [[118, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_valatt", 
      "name": "bertencoder0_transformer2_dotproductselfattentioncell0_interleaved_matmul_selfatt_valatt0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[117, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer2_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer2__plus0", 
      "inputs": [[128, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer2_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[132, 0, 0], [133, 0, 0], [134, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "bertencoder0_transformer2_positionwiseffn0_gelu0_leakyrelu0", 
      "attrs": {"act_type": "gelu"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer2_positionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer2_positionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[139, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer2_positionwiseffn0__plus0", 
      "inputs": [[140, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer2_positionwiseffn0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer2_positionwiseffn0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[141, 0, 0], [142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_reshape0", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_reshape2", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_concat0", 
      "attrs": {
        "dim": "-2", 
        "num_args": "3"
      }, 
      "inputs": [[146, 0, 0], [148, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_reshape3", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_query_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_key_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_value_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_concat1", 
      "attrs": {
        "dim": "0", 
        "num_args": "3"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_fullyconnected0", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[144, 0, 0], [152, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_qk", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_interleaved_matmul_selfatt_qk0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_expand_dims0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "broadcast_axis", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_broadcast_axis0", 
      "attrs": {
        "axis": "1", 
        "size": "12"
      }, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_reshape4", 
      "attrs": {
        "reverse": "True", 
        "shape": "(-1, 0)"
      }, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_softmax0", 
      "attrs": {
        "axis": "-1", 
        "use_length": "True"
      }, 
      "inputs": [[158, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "_contrib_interleaved_matmul_selfatt_valatt", 
      "name": "bertencoder0_transformer3_dotproductselfattentioncell0_interleaved_matmul_selfatt_valatt0", 
      "attrs": {"heads": "12"}, 
      "inputs": [[157, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_proj_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_proj_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer3_proj_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer3_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer3__plus0", 
      "inputs": [[168, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer3_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[172, 0, 0], [173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "bertencoder0_transformer3_positionwiseffn0_gelu0_leakyrelu0", 
      "attrs": {"act_type": "gelu"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "bertencoder0_transformer3_positionwiseffn0_ffn_2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0], [178, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "bertencoder0_transformer3_positionwiseffn0_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "bertencoder0_transformer3_positionwiseffn0__plus0", 
      "inputs": [[180, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_layernorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer3_positionwiseffn0_layernorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "bertencoder0_transformer3_positionwiseffn0_layernorm0_layernorm0", 
      "attrs": {
        "axis": "-1", 
        "eps": "1e-12"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_query_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_reshape0", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_key_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_reshape1", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_value_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_reshape2", 
      "attrs": {
        "reverse": "True", 
        "shape": "(12, -1, 0)"
      }, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "bertencoder0_transformer4_dotproductselfattentioncell0_concat0", 
      "attrs": {
        "dim": "-2", 
