{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }
  ], 
  "arg_nodes": [0, 1, 2], 
  "node_row_ptr": [0, 1, 2, 3], 
  "heads": [[0, 0, 0], [1, 0, 0], [2, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10700]}
}