{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "attrs": {"__shape__": "(0, 1, 28, 28)"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "_data_mean_", 
      "attrs": {
        "__init__": "[\"myconstant\", {\"value\": [[[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 9.843750376603566e-06, 3.6718749470310286e-05, 1.6874999346327968e-05, 7.031250106592779e-07, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 1.249999968422344e-06, 4.296874976716936e-06, 4.351562529336661e-05, 0.00010812500113388523, 0.0001553906186018139, 0.0002101562567986548, 0.0003796093806158751, 0.0005697656306438148, 0.0006417968543246388, 0.0006689843721687794, 0.000712656241375953, 0.0006771875196136534, 0.0006935937562957406, 0.0005208593793213367, 0.00033039061236195266, 0.00024867188767530024, 0.0002135937538696453, 7.937500049592927e-05, 3.8124999264255166e-05, 1.6562500604777597e-05, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 4.999999873689376e-06, 2.265624971187208e-06, 3.085937350988388e-05, 2.2265625375439413e-05, 0.00018929687212221324, 0.0005417187348939478, 0.0010433593997731805, 0.0019339843420311809, 0.0032413280569016933, 0.0049420311115682125, 0.007491328287869692, 0.010112266056239605, 0.012418827973306179, 0.013696406036615372, 0.013877343386411667, 0.012813594192266464, 0.010700312443077564, 0.007773828227072954, 0.004664296749979258, 0.0024010157212615013, 0.0011050781467929482, 0.0004012499994132668, 0.0001650781196076423, 4.046874892082997e-05, 0.0, 0.0], [0.0, 0.0, 1.1875000382133294e-05, 1.7265625501750037e-05, 4.046874892082997e-05, 0.000286484370008111, 0.0009105468634516001, 0.0022580467630177736, 0.004638125188648701, 0.008705937303602695, 0.01424914039671421, 0.021368281915783882, 0.02903718687593937, 0.03777187317609787, 0.04554898291826248, 0.050161875784397125, 0.04971765726804733, 0.04510781168937683, 0.036905232816934586, 0.02648460865020752, 0.01611398346722126, 0.008655937388539314, 0.004118749871850014, 0.001715078135021031, 0.0007089843857102096, 0.00012671874719671905, 1.3124999895808287e-05, 0.0], [0.0, 2.9687500955333235e-06, 9.765624781721272e-06, 4.492187508731149e-05, 0.0003044531331397593, 0.0016588281141594052, 0.004228281322866678, 0.009668281301856041, 0.018933983519673347, 0.033166639506816864, 0.05273773521184921, 0.07656367123126984, 0.10577508062124252, 0.13668102025985718, 0.16155602037906647, 0.17495296895503998, 0.1715133637189865, 0.1515217125415802, 0.121553435921669, 0.08872398734092712, 0.05751398578286171, 0.033358048647642136, 0.01729070395231247, 0.008051484823226929, 0.0033067967742681503, 0.0008369531133212149, 0.0001331249950453639, 9.531249816063792e-06], [0.0, 0.0, 3.6093748349230736e-05, 0.00023945311841089278, 0.0015970312524586916, 0.005945547018200159, 0.014461171813309193, 0.02867281250655651, 0.05121000111103058, 0.08333367109298706, 0.12373749911785126, 0.17296695709228516, 0.22945156693458557, 0.28728774189949036, 0.3308878242969513, 0.35189250111579895, 0.34530147910118103, 0.31105664372444153, 0.255467027425766, 0.1927814781665802, 0.13309195637702942, 0.08285460621118546, 0.04731351509690285, 0.02512851543724537, 0.011450468562543392, 0.0032229686621576548, 0.0005106250173412263, 1.8750000890577212e-05], [0.0, 8.593750067120709e-07, 0.00012007812620140612, 0.0008751562563702464, 0.0045014843344688416, 0.013197812251746655, 0.029670780524611473, 0.05631484463810921, 0.09545288980007172, 0.1466144472360611, 0.20809273421764374, 0.2771909236907959, 0.3485493063926697, 0.41470274329185486, 0.4623042941093445, 0.4841516315937042, 0.4744681119918823, 0.4362390637397766, 0.37377139925956726, 0.29203975200653076, 0.2100742906332016, 0.1373133659362793, 0.0815473422408104, 0.044088516384363174, 0.020767344161868095, 0.007203124929219484, 0.0014442187966778874, 0.0001331249950453639], [3.6718749925057637e-06, 8.468749729217961e-05, 0.0004185937577858567, 0.002351640723645687, 0.009015780873596668, 0.023322030901908875, 0.04892929643392563, 0.08851773291826248, 0.14344234764575958, 0.21176180243492126, 0.28874483704566956, 0.3675253987312317, 0.4355321228504181, 0.48811954259872437, 0.519627571105957, 0.5308137536048889, 0.5221337676048279, 0.4953942894935608, 0.4433194398880005, 0.36514779925346375, 0.2720317840576172, 0.18375679850578308, 0.11079562455415726, 0.06002437323331833, 0.027996249496936798, 0.010350546799600124, 0.0020667968783527613, 0.00012914062244817615], [1.4921874935680535e-05, 0.00021039062994532287, 0.0012622656067833304, 0.005107187665998936, 0.014642422087490559, 0.03317203000187874, 0.06590586155653, 0.11643703281879425, 0.1844753921031952, 0.26737773418426514, 0.35323625802993774, 0.42301470041275024, 0.4657210111618042, 0.48295313119888306, 0.48392680287361145, 0.48208242654800415, 0.4826752245426178, 0.47950467467308044, 0.45483946800231934, 0.39241960644721985, 0.3018142282962799, 0.20787227153778076, 0.12600436806678772, 0.06548406183719635, 0.029092734679579735, 0.010524765588343143, 0.0019053906435146928, 0.00011656249989755452], [8.437499673163984e-06, 0.00034601561492308974, 0.00199156254529953, 0.006605156231671572, 0.017200235277414322, 0.03829687461256981, 0.07635453343391418, 0.13519898056983948, 0.21477819979190826, 0.30624741315841675, 0.386896550655365, 0.43073344230651855, 0.43240055441856384, 0.4103866517543793, 0.39128798246383667, 0.3928200900554657, 0.41175851225852966, 0.4365885853767395, 0.4351573586463928, 0.38698679208755493, 0.3013893663883209, 0.20766812562942505, 0.12520156800746918, 0.06200726702809334, 0.02441960945725441, 0.0078094531781971455, 0.0014540625270456076, 0.00012343749403953552], [1.4531249689753167e-05, 0.0003995312436018139, 0.0019350781803950667, 0.006292968522757292, 0.01653788983821869, 0.038458045572042465, 0.08020515739917755, 0.14567922055721283, 0.23434163630008698, 0.32656335830688477, 0.3908255398273468, 0.40221983194351196, 0.3676988184452057, 0.32750532031059265, 0.31521305441856384, 0.3346457779407501, 0.37103337049484253, 0.41089922189712524, 0.41513803601264954, 0.3677763342857361, 0.28195351362228394, 0.1906936764717102, 0.11328648775815964, 0.05413554608821869, 0.018782969564199448, 0.004811171907931566, 0.0009558593737892807, 7.804687629686669e-05], [2.6015624825959094e-05, 0.0002569531206972897, 0.0015153124695643783, 0.004831406287848949, 0.014136484824120998, 0.037452030926942825, 0.08296023309230804, 0.1568756252527237, 0.2516380548477173, 0.34128397703170776, 0.38550445437431335, 0.3699997663497925, 0.32041335105895996, 0.2898925840854645, 0.3013165593147278, 0.3369489908218384, 0.38263633847236633, 0.42126351594924927, 0.41159483790397644, 0.3481563329696655, 0.25557124614715576, 0.1677713245153427, 0.10028023272752762, 0.049933984875679016, 0.01598718762397766, 0.002444140613079071, 0.0004960156511515379, 3.8281250454019755e-05], [1.7812499208957888e-05, 0.00017250000382773578, 0.0008825781405903399, 0.0033665625378489494, 0.012097890488803387, 0.03802820295095444, 0.08972249925136566, 0.17177820205688477, 0.2706272602081299, 0.35258257389068604, 0.3823712468147278, 0.35612374544143677, 0.31222179532051086, 0.312639445066452, 0.3514957129955292, 0.3989346921443939, 0.4426496922969818, 0.4599170386791229, 0.4196406900882721, 0.33129391074180603, 0.23098890483379364, 0.15120922029018402, 0.09364382922649384, 0.05027398467063904, 0.01717984303832054, 0.0018232031725347042, 0.00032125000143423676, 4.765624908031896e-05], [2.499999936844688e-06, 8.359375351574272e-05, 0.00045453125494532287, 0.002422812394797802, 0.011678359471261501, 0.04197132959961891, 0.10020484030246735, 0.18696023523807526, 0.2848072648048401, 0.35876601934432983, 0.37981998920440674, 0.3576873540878296, 0.3414090573787689, 0.3813945949077606, 0.4367414116859436, 0.4854142963886261, 0.5080604553222656, 0.4937942326068878, 0.4251500070095062, 0.3183615505695343, 0.21742288768291473, 0.14672726392745972, 0.09452781081199646, 0.053825389593839645, 0.02025921829044819, 0.00233812490478158, 0.0003122656198684126, 5.093749859952368e-05], [8.828124919091351e-06, 3.867187479045242e-05, 0.00020585938182193786, 0.0018549219239503145, 0.012160547077655792, 0.04867968708276749, 0.11140351742506027, 0.1981770247220993, 0.2888886630535126, 0.35421210527420044, 0.3735390603542328, 0.3669896125793457, 0.38513320684432983, 0.4536341428756714, 0.5114089250564575, 0.5470447540283203, 0.5363470315933228, 0.4996432960033417, 0.4181937575340271, 0.311815470457077, 0.22061406075954437, 0.15316101908683777, 0.1004846841096878, 0.057641249150037766, 0.022539999336004257, 0.0032877344638109207, 0.0003951562393922359, 1.0390624993306119e-05], [3.4375000268482836e-06, 1.8124999769497663e-05, 0.00018234374874737114, 0.0020721876062452793, 0.013990391045808792, 0.056441329419612885, 0.12125281244516373, 0.20036429166793823, 0.2796046733856201, 0.335735559463501, 0.3585376441478729, 0.3700703978538513, 0.41267359256744385, 0.48365968465805054, 0.5324289798736572, 0.5459054708480835, 0.5155280232429504, 0.4743088185787201, 0.39597079157829285, 0.3068067133426666, 0.22863531112670898, 0.16180483996868134, 0.10625585913658142, 0.05876101553440094, 0.023312577977776527, 0.004458359442651272, 0.0006627343827858567, 3.9999998989515007e-05], [3.12499992105586e-06, 1.8593749700812623e-05, 0.0003206249966751784, 0.0025363280437886715, 0.01757046952843666, 0.06433062255382538, 0.1274501532316208, 0.1955278068780899, 0.25954365730285645, 0.3047671914100647, 0.32774248719215393, 0.34997084736824036, 0.39597851037979126, 0.4547521770000458, 0.49670493602752686, 0.5002762675285339, 0.4736476540565491, 0.4347068667411804, 0.3728382885456085, 0.30261069536209106, 0.23319397866725922, 0.1650128960609436, 0.10532929748296738, 0.05636609345674515, 0.022620312869548798, 0.005238906480371952, 0.000772578117903322, 3.289062442490831e-05], [0.0, 3.414062666706741e-05, 0.0005000000237487257, 0.0039152344688773155, 0.02306945249438286, 0.07191570103168488, 0.1311785876750946, 0.18898148834705353, 0.2375076562166214, 0.2718598544597626, 0.29322531819343567, 0.31613415479660034, 0.3505239188671112, 0.40052586793899536, 0.44323959946632385, 0.4530692994594574, 0.4388467073440552, 0.4088331162929535, 0.36179110407829285, 0.3017326593399048, 0.23167484998703003, 0.16004641354084015, 0.09819258004426956, 0.05074796825647354, 0.020610546693205833, 0.005660625174641609, 0.0008571874932385981, 4.093749885214493e-05], [4.218749836581992e-06, 2.4921875592553988e-05, 0.0007650781190022826, 0.006223124917596579, 0.029345937073230743, 0.07937132567167282, 0.13702265918254852, 0.18958835303783417, 0.22951844334602356, 0.25973373651504517, 0.2818928062915802, 0.2998753786087036, 0.3262309432029724, 0.3748679757118225, 0.4195018708705902, 0.43967461585998535, 0.4345223307609558, 0.40968087315559387, 0.3654811680316925, 0.2993174195289612, 0.22168944776058197, 0.14823491871356964, 0.08879250288009644, 0.044686250388622284, 0.01809726655483246, 0.005111953243613243, 0.000624140608124435, 5.7109373301500455e-05], [1.1718750556610757e-06, 4.95312488055788e-05, 0.0012305468553677201, 0.00822445284575224, 0.03376413881778717, 0.08454914391040802, 0.14449788630008698, 0.20010116696357727, 0.24448679387569427, 0.2796807885169983, 0.30517876148223877, 0.3242635130882263, 0.3539736866950989, 0.39903876185417175, 0.44074609875679016, 0.4591413140296936, 0.4509447515010834, 0.41816475987434387, 0.3599049150943756, 0.2812415659427643, 0.19944937527179718, 0.12861303985118866, 0.0736529678106308, 0.03578921779990196, 0.014180468395352364, 0.0041057029739022255, 0.0005485156434588134, 3.101562469964847e-05], [0.0, 7.156249921536073e-05, 0.001407656236551702, 0.00911093782633543, 0.03313359245657921, 0.08095921576023102, 0.14496609568595886, 0.20973655581474304, 0.26819735765457153, 0.31669774651527405, 0.3538305461406708, 0.38432928919792175, 0.41895461082458496, 0.45934006571769714, 0.48712390661239624, 0.48838359117507935, 0.45992937684059143, 0.4052446186542511, 0.3286994397640228, 0.2408815622329712, 0.16093343496322632, 0.09798257797956467, 0.05312320217490196, 0.02537679672241211, 0.01021929644048214, 0.0028088281396776438, 0.00038718749419786036, 3.906250185536919e-06], [2.499999936844688e-06, 5.953124855295755e-05, 0.0012016405817121267, 0.00737234391272068, 0.02608742192387581, 0.06630992144346237, 0.12835735082626343, 0.20047812163829803, 0.27338021993637085, 0.3394293785095215, 0.39472585916519165, 0.4407339096069336, 0.4801346957683563, 0.5090382099151611, 0.5135530233383179, 0.4869477450847626, 0.43002256751060486, 0.3514121174812317, 0.2623575031757355, 0.17957530915737152, 0.11240758001804352, 0.06395398080348969, 0.03325507789850235, 0.015847109258174896, 0.006505156401544809, 0.001632031286135316, 0.0002179687435273081, 3.0468750082945917e-06], [2.4218750240834197e-06, 4.609375082509359e-06, 0.0008078906103037298, 0.004433437716215849, 0.015812110155820847, 0.04297921806573868, 0.09203577786684036, 0.1583360880613327, 0.23680523037910461, 0.31474757194519043, 0.38593101501464844, 0.44128501415252686, 0.47778335213661194, 0.4882955551147461, 0.47035109996795654, 0.4200114905834198, 0.34462398290634155, 0.2598000764846802, 0.17899155616760254, 0.11329180002212524, 0.06681398302316666, 0.03637773543596268, 0.01863601617515087, 0.008606953546404839, 0.0032477343920618296, 0.0007182031404227018, 6.906250200700015e-05, 5.625000085274223e-06], [0.0, 0.0, 0.0002769531274680048, 0.001708984375, 0.007025234401226044, 0.02024742215871811, 0.0479990616440773, 0.0943639874458313, 0.15761585533618927, 0.22939015924930573, 0.30062657594680786, 0.35752537846565247, 0.386766642332077, 0.3847484290599823, 0.3526030480861664, 0.29681482911109924, 0.2264709323644638, 0.15845054388046265, 0.10104507952928543, 0.060485467314720154, 0.0342111736536026, 0.017959844321012497, 0.008922109380364418, 0.0038772656116634607, 0.0012010156642645597, 0.00022250000620260835, 4.054687451571226e-05, 0.0], [0.0, 0.0, 7.359375013038516e-05, 0.0004949999856762588, 0.002245156327262521, 0.006543906405568123, 0.017120156437158585, 0.0365971103310585, 0.06647851318120956, 0.10609336197376251, 0.14829492568969727, 0.18220999836921692, 0.19881977140903473, 0.19662906229496002, 0.17674078047275543, 0.14418382942676544, 0.10817375034093857, 0.07512171566486359, 0.047856640070676804, 0.02878156304359436, 0.01589195244014263, 0.00823828112334013, 0.003930546808987856, 0.0016475780867040157, 0.0004106250125914812, 0.00010054687299998477, 9.062499884748831e-06, 0.0], [0.0, 0.0, 7.343749985011527e-06, 8.335937309311703e-05, 0.0005408593569882214, 0.0019508593250066042, 0.005865156184881926, 0.01304421853274107, 0.024842265993356705, 0.03926265612244606, 0.05450023338198662, 0.06438906490802765, 0.06896429508924484, 0.06790648400783539, 0.06137249991297722, 0.05161336064338684, 0.04139577969908714, 0.030469296500086784, 0.020495155826210976, 0.01271195337176323, 0.0068567185662686825, 0.0034882030449807644, 0.001586328144185245, 0.0005980468704365194, 0.00012351562327239662, 1.6718749975552782e-05, 8.125000022118911e-06, 0.0], [0.0, 0.0, 0.0, 2.9687500955333235e-06, 0.0001519531215308234, 0.0006688281428068876, 0.0021832813508808613, 0.004780312534421682, 0.009269609116017818, 0.013831015676259995, 0.018620546907186508, 0.022453827783465385, 0.023881327360868454, 0.02349359355866909, 0.021288437768816948, 0.017397109419107437, 0.0139752347022295, 0.010080547071993351, 0.006602734327316284, 0.003966562449932098, 0.0021678905468434095, 0.0010391406249254942, 0.00033320311922580004, 6.695312185911462e-05, 2.343749940791895e-07, 4.609375082509359e-06, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 1.1875000382133294e-05, 6.671874871244654e-05, 0.0001734374964144081, 0.00037664061528630555, 0.0005010937456972897, 0.0007093750173225999, 0.0011590624926611781, 0.0014403124805539846, 0.001910234335809946, 0.0020442968234419823, 0.002479375107213855, 0.002171406289562583, 0.0017252343241125345, 0.001215156284160912, 0.0007388281519524753, 0.0003538281307555735, 0.000204140626010485, 9.039062570082024e-05, 7.085937249939889e-05, 9.375000445288606e-06, 0.0, 0.0, 0.0, 0.0]]]}]", 
        "__shape__": "(1, 28, 28)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad0", 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "broadcast_sub", 
      "name": "broadcast_sub0", 
      "inputs": [[0, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "_data_std_", 
      "attrs": {
        "__init__": "[\"myconstant\", {\"value\": [[[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 9.843750376603566e-06, 3.6718749470310286e-05, 1.6874999346327968e-05, 7.031250106592779e-07, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 1.249999968422344e-06, 4.296874976716936e-06, 4.351562529336661e-05, 0.00010812500113388523, 0.0001553906186018139, 0.0002101562567986548, 0.0003796093806158751, 0.0005697656306438148, 0.0006417968543246388, 0.0006689843721687794, 0.000712656241375953, 0.0006771875196136534, 0.0006935937562957406, 0.0005208593793213367, 0.00033039061236195266, 0.00024867188767530024, 0.0002135937538696453, 7.937500049592927e-05, 3.8124999264255166e-05, 1.6562500604777597e-05, 0.0, 0.0, 0.0, 0.0], [0.0, 0.0, 4.999999873689376e-06, 2.265624971187208e-06, 3.085937350988388e-05, 2.2265625375439413e-05, 0.00018929687212221324, 0.0005417187348939478, 0.0010433593997731805, 0.0019339843420311809, 0.0032413280569016933, 0.0049420311115682125, 0.007491328287869692, 0.010112266056239605, 0.012418827973306179, 0.013696406036615372, 0.013877343386411667, 0.012813594192266464, 0.010700312443077564, 0.007773828227072954, 0.004664296749979258, 0.0024010157212615013, 0.0011050781467929482, 0.0004012499994132668, 0.0001650781196076423, 4.046874892082997e-05, 0.0, 0.0], [0.0, 0.0, 1.1875000382133294e-05, 1.7265625501750037e-05, 4.046874892082997e-05, 0.000286484370008111, 0.0009105468634516001, 0.0022580467630177736, 0.004638125188648701, 0.008705937303602695, 0.01424914039671421, 0.021368281915783882, 0.02903718687593937, 0.03777187317609787, 0.04554898291826248, 0.050161875784397125, 0.04971765726804733, 0.04510781168937683, 0.036905232816934586, 0.02648460865020752, 0.01611398346722126, 0.008655937388539314, 0.004118749871850014, 0.001715078135021031, 0.0007089843857102096, 0.00012671874719671905, 1.3124999895808287e-05, 0.0], [0.0, 2.9687500955333235e-06, 9.765624781721272e-06, 4.492187508731149e-05, 0.0003044531331397593, 0.0016588281141594052, 0.004228281322866678, 0.009668281301856041, 0.018933983519673347, 0.033166639506816864, 0.05273773521184921, 0.07656367123126984, 0.10577508062124252, 0.13668102025985718, 0.16155602037906647, 0.17495296895503998, 0.1715133637189865, 0.1515217125415802, 0.121553435921669, 0.08872398734092712, 0.05751398578286171, 0.033358048647642136, 0.01729070395231247, 0.008051484823226929, 0.0033067967742681503, 0.0008369531133212149, 0.0001331249950453639, 9.531249816063792e-06], [0.0, 0.0, 3.6093748349230736e-05, 0.00023945311841089278, 0.0015970312524586916, 0.005945547018200159, 0.014461171813309193, 0.02867281250655651, 0.05121000111103058, 0.08333367109298706, 0.12373749911785126, 0.17296695709228516, 0.22945156693458557, 0.28728774189949036, 0.3308878242969513, 0.35189250111579895, 0.34530147910118103, 0.31105664372444153, 0.255467027425766, 0.1927814781665802, 0.13309195637702942, 0.08285460621118546, 0.04731351509690285, 0.02512851543724537, 0.011450468562543392, 0.0032229686621576548, 0.0005106250173412263, 1.8750000890577212e-05], [0.0, 8.593750067120709e-07, 0.00012007812620140612, 0.0008751562563702464, 0.0045014843344688416, 0.013197812251746655, 0.029670780524611473, 0.05631484463810921, 0.09545288980007172, 0.1466144472360611, 0.20809273421764374, 0.2771909236907959, 0.3485493063926697, 0.41470274329185486, 0.4623042941093445, 0.4841516315937042, 0.4744681119918823, 0.4362390637397766, 0.37377139925956726, 0.29203975200653076, 0.2100742906332016, 0.1373133659362793, 0.0815473422408104, 0.044088516384363174, 0.020767344161868095, 0.007203124929219484, 0.0014442187966778874, 0.0001331249950453639], [3.6718749925057637e-06, 8.468749729217961e-05, 0.0004185937577858567, 0.002351640723645687, 0.009015780873596668, 0.023322030901908875, 0.04892929643392563, 0.08851773291826248, 0.14344234764575958, 0.21176180243492126, 0.28874483704566956, 0.3675253987312317, 0.4355321228504181, 0.48811954259872437, 0.519627571105957, 0.5308137536048889, 0.5221337676048279, 0.4953942894935608, 0.4433194398880005, 0.36514779925346375, 0.2720317840576172, 0.18375679850578308, 0.11079562455415726, 0.06002437323331833, 0.027996249496936798, 0.010350546799600124, 0.0020667968783527613, 0.00012914062244817615], [1.4921874935680535e-05, 0.00021039062994532287, 0.0012622656067833304, 0.005107187665998936, 0.014642422087490559, 0.03317203000187874, 0.06590586155653, 0.11643703281879425, 0.1844753921031952, 0.26737773418426514, 0.35323625802993774, 0.42301470041275024, 0.4657210111618042, 0.48295313119888306, 0.48392680287361145, 0.48208242654800415, 0.4826752245426178, 0.47950467467308044, 0.45483946800231934, 0.39241960644721985, 0.3018142282962799, 0.20787227153778076, 0.12600436806678772, 0.06548406183719635, 0.029092734679579735, 0.010524765588343143, 0.0019053906435146928, 0.00011656249989755452], [8.437499673163984e-06, 0.00034601561492308974, 0.00199156254529953, 0.006605156231671572, 0.017200235277414322, 0.03829687461256981, 0.07635453343391418, 0.13519898056983948, 0.21477819979190826, 0.30624741315841675, 0.386896550655365, 0.43073344230651855, 0.43240055441856384, 0.4103866517543793, 0.39128798246383667, 0.3928200900554657, 0.41175851225852966, 0.4365885853767395, 0.4351573586463928, 0.38698679208755493, 0.3013893663883209, 0.20766812562942505, 0.12520156800746918, 0.06200726702809334, 0.02441960945725441, 0.0078094531781971455, 0.0014540625270456076, 0.00012343749403953552], [1.4531249689753167e-05, 0.0003995312436018139, 0.0019350781803950667, 0.006292968522757292, 0.01653788983821869, 0.038458045572042465, 0.08020515739917755, 0.14567922055721283, 0.23434163630008698, 0.32656335830688477, 0.3908255398273468, 0.40221983194351196, 0.3676988184452057, 0.32750532031059265, 0.31521305441856384, 0.3346457779407501, 0.37103337049484253, 0.41089922189712524, 0.41513803601264954, 0.3677763342857361, 0.28195351362228394, 0.1906936764717102, 0.11328648775815964, 0.05413554608821869, 0.018782969564199448, 0.004811171907931566, 0.0009558593737892807, 7.804687629686669e-05], [2.6015624825959094e-05, 0.0002569531206972897, 0.0015153124695643783, 0.004831406287848949, 0.014136484824120998, 0.037452030926942825, 0.08296023309230804, 0.1568756252527237, 0.2516380548477173, 0.34128397703170776, 0.38550445437431335, 0.3699997663497925, 0.32041335105895996, 0.2898925840854645, 0.3013165593147278, 0.3369489908218384, 0.38263633847236633, 0.42126351594924927, 0.41159483790397644, 0.3481563329696655, 0.25557124614715576, 0.1677713245153427, 0.10028023272752762, 0.049933984875679016, 0.01598718762397766, 0.002444140613079071, 0.0004960156511515379, 3.8281250454019755e-05], [1.7812499208957888e-05, 0.00017250000382773578, 0.0008825781405903399, 0.0033665625378489494, 0.012097890488803387, 0.03802820295095444, 0.08972249925136566, 0.17177820205688477, 0.2706272602081299, 0.35258257389068604, 0.3823712468147278, 0.35612374544143677, 0.31222179532051086, 0.312639445066452, 0.3514957129955292, 0.3989346921443939, 0.4426496922969818, 0.4599170386791229, 0.4196406900882721, 0.33129391074180603, 0.23098890483379364, 0.15120922029018402, 0.09364382922649384, 0.05027398467063904, 0.01717984303832054, 0.0018232031725347042, 0.00032125000143423676, 4.765624908031896e-05], [2.499999936844688e-06, 8.359375351574272e-05, 0.00045453125494532287, 0.002422812394797802, 0.011678359471261501, 0.04197132959961891, 0.10020484030246735, 0.18696023523807526, 0.2848072648048401, 0.35876601934432983, 0.37981998920440674, 0.3576873540878296, 0.3414090573787689, 0.3813945949077606, 0.4367414116859436, 0.4854142963886261, 0.5080604553222656, 0.4937942326068878, 0.4251500070095062, 0.3183615505695343, 0.21742288768291473, 0.14672726392745972, 0.09452781081199646, 0.053825389593839645, 0.02025921829044819, 0.00233812490478158, 0.0003122656198684126, 5.093749859952368e-05], [8.828124919091351e-06, 3.867187479045242e-05, 0.00020585938182193786, 0.0018549219239503145, 0.012160547077655792, 0.04867968708276749, 0.11140351742506027, 0.1981770247220993, 0.2888886630535126, 0.35421210527420044, 0.3735390603542328, 0.3669896125793457, 0.38513320684432983, 0.4536341428756714, 0.5114089250564575, 0.5470447540283203, 0.5363470315933228, 0.4996432960033417, 0.4181937575340271, 0.311815470457077, 0.22061406075954437, 0.15316101908683777, 0.1004846841096878, 0.057641249150037766, 0.022539999336004257, 0.0032877344638109207, 0.0003951562393922359, 1.0390624993306119e-05], [3.4375000268482836e-06, 1.8124999769497663e-05, 0.00018234374874737114, 0.0020721876062452793, 0.013990391045808792, 0.056441329419612885, 0.12125281244516373, 0.20036429166793823, 0.2796046733856201, 0.335735559463501, 0.3585376441478729, 0.3700703978538513, 0.41267359256744385, 0.48365968465805054, 0.5324289798736572, 0.5459054708480835, 0.5155280232429504, 0.4743088185787201, 0.39597079157829285, 0.3068067133426666, 0.22863531112670898, 0.16180483996868134, 0.10625585913658142, 0.05876101553440094, 0.023312577977776527, 0.004458359442651272, 0.0006627343827858567, 3.9999998989515007e-05], [3.12499992105586e-06, 1.8593749700812623e-05, 0.0003206249966751784, 0.0025363280437886715, 0.01757046952843666, 0.06433062255382538, 0.1274501532316208, 0.1955278068780899, 0.25954365730285645, 0.3047671914100647, 0.32774248719215393, 0.34997084736824036, 0.39597851037979126, 0.4547521770000458, 0.49670493602752686, 0.5002762675285339, 0.4736476540565491, 0.4347068667411804, 0.3728382885456085, 0.30261069536209106, 0.23319397866725922, 0.1650128960609436, 0.10532929748296738, 0.05636609345674515, 0.022620312869548798, 0.005238906480371952, 0.000772578117903322, 3.289062442490831e-05], [0.0, 3.414062666706741e-05, 0.0005000000237487257, 0.0039152344688773155, 0.02306945249438286, 0.07191570103168488, 0.1311785876750946, 0.18898148834705353, 0.2375076562166214, 0.2718598544597626, 0.29322531819343567, 0.31613415479660034, 0.3505239188671112, 0.40052586793899536, 0.44323959946632385, 0.4530692994594574, 0.4388467073440552, 0.4088331162929535, 0.36179110407829285, 0.3017326593399048, 0.23167484998703003, 0.16004641354084015, 0.09819258004426956, 0.05074796825647354, 0.020610546693205833, 0.005660625174641609, 0.0008571874932385981, 4.093749885214493e-05], [4.218749836581992e-06, 2.4921875592553988e-05, 0.0007650781190022826, 0.006223124917596579, 0.029345937073230743, 0.07937132567167282, 0.13702265918254852, 0.18958835303783417, 0.22951844334602356, 0.25973373651504517, 0.2818928062915802, 0.2998753786087036, 0.3262309432029724, 0.3748679757118225, 0.4195018708705902, 0.43967461585998535, 0.4345223307609558, 0.40968087315559387, 0.3654811680316925, 0.2993174195289612, 0.22168944776058197, 0.14823491871356964, 0.08879250288009644, 0.044686250388622284, 0.01809726655483246, 0.005111953243613243, 0.000624140608124435, 5.7109373301500455e-05], [1.1718750556610757e-06, 4.95312488055788e-05, 0.0012305468553677201, 0.00822445284575224, 0.03376413881778717, 0.08454914391040802, 0.14449788630008698, 0.20010116696357727, 0.24448679387569427, 0.2796807885169983, 0.30517876148223877, 0.3242635130882263, 0.3539736866950989, 0.39903876185417175, 0.44074609875679016, 0.4591413140296936, 0.4509447515010834, 0.41816475987434387, 0.3599049150943756, 0.2812415659427643, 0.19944937527179718, 0.12861303985118866, 0.0736529678106308, 0.03578921779990196, 0.014180468395352364, 0.0041057029739022255, 0.0005485156434588134, 3.101562469964847e-05], [0.0, 7.156249921536073e-05, 0.001407656236551702, 0.00911093782633543, 0.03313359245657921, 0.08095921576023102, 0.14496609568595886, 0.20973655581474304, 0.26819735765457153, 0.31669774651527405, 0.3538305461406708, 0.38432928919792175, 0.41895461082458496, 0.45934006571769714, 0.48712390661239624, 0.48838359117507935, 0.45992937684059143, 0.4052446186542511, 0.3286994397640228, 0.2408815622329712, 0.16093343496322632, 0.09798257797956467, 0.05312320217490196, 0.02537679672241211, 0.01021929644048214, 0.0028088281396776438, 0.00038718749419786036, 3.906250185536919e-06], [2.499999936844688e-06, 5.953124855295755e-05, 0.0012016405817121267, 0.00737234391272068, 0.02608742192387581, 0.06630992144346237, 0.12835735082626343, 0.20047812163829803, 0.27338021993637085, 0.3394293785095215, 0.39472585916519165, 0.4407339096069336, 0.4801346957683563, 0.5090382099151611, 0.5135530233383179, 0.4869477450847626, 0.43002256751060486, 0.3514121174812317, 0.2623575031757355, 0.17957530915737152, 0.11240758001804352, 0.06395398080348969, 0.03325507789850235, 0.015847109258174896, 0.006505156401544809, 0.001632031286135316, 0.0002179687435273081, 3.0468750082945917e-06], [2.4218750240834197e-06, 4.609375082509359e-06, 0.0008078906103037298, 0.004433437716215849, 0.015812110155820847, 0.04297921806573868, 0.09203577786684036, 0.1583360880613327, 0.23680523037910461, 0.31474757194519043, 0.38593101501464844, 0.44128501415252686, 0.47778335213661194, 0.4882955551147461, 0.47035109996795654, 0.4200114905834198, 0.34462398290634155, 0.2598000764846802, 0.17899155616760254, 0.11329180002212524, 0.06681398302316666, 0.03637773543596268, 0.01863601617515087, 0.008606953546404839, 0.0032477343920618296, 0.0007182031404227018, 6.906250200700015e-05, 5.625000085274223e-06], [0.0, 0.0, 0.0002769531274680048, 0.001708984375, 0.007025234401226044, 0.02024742215871811, 0.0479990616440773, 0.0943639874458313, 0.15761585533618927, 0.22939015924930573, 0.30062657594680786, 0.35752537846565247, 0.386766642332077, 0.3847484290599823, 0.3526030480861664, 0.29681482911109924, 0.2264709323644638, 0.15845054388046265, 0.10104507952928543, 0.060485467314720154, 0.0342111736536026, 0.017959844321012497, 0.008922109380364418, 0.0038772656116634607, 0.0012010156642645597, 0.00022250000620260835, 4.054687451571226e-05, 0.0], [0.0, 0.0, 7.359375013038516e-05, 0.0004949999856762588, 0.002245156327262521, 0.006543906405568123, 0.017120156437158585, 0.0365971103310585, 0.06647851318120956, 0.10609336197376251, 0.14829492568969727, 0.18220999836921692, 0.19881977140903473, 0.19662906229496002, 0.17674078047275543, 0.14418382942676544, 0.10817375034093857, 0.07512171566486359, 0.047856640070676804, 0.02878156304359436, 0.01589195244014263, 0.00823828112334013, 0.003930546808987856, 0.0016475780867040157, 0.0004106250125914812, 0.00010054687299998477, 9.062499884748831e-06, 0.0], [0.0, 0.0, 7.343749985011527e-06, 8.335937309311703e-05, 0.0005408593569882214, 0.0019508593250066042, 0.005865156184881926, 0.01304421853274107, 0.024842265993356705, 0.03926265612244606, 0.05450023338198662, 0.06438906490802765, 0.06896429508924484, 0.06790648400783539, 0.06137249991297722, 0.05161336064338684, 0.04139577969908714, 0.030469296500086784, 0.020495155826210976, 0.01271195337176323, 0.0068567185662686825, 0.0034882030449807644, 0.001586328144185245, 0.0005980468704365194, 0.00012351562327239662, 1.6718749975552782e-05, 8.125000022118911e-06, 0.0], [0.0, 0.0, 0.0, 2.9687500955333235e-06, 0.0001519531215308234, 0.0006688281428068876, 0.0021832813508808613, 0.004780312534421682, 0.009269609116017818, 0.013831015676259995, 0.018620546907186508, 0.022453827783465385, 0.023881327360868454, 0.02349359355866909, 0.021288437768816948, 0.017397109419107437, 0.0139752347022295, 0.010080547071993351, 0.006602734327316284, 0.003966562449932098, 0.0021678905468434095, 0.0010391406249254942, 0.00033320311922580004, 6.695312185911462e-05, 2.343749940791895e-07, 4.609375082509359e-06, 0.0, 0.0], [0.0, 0.0, 0.0, 0.0, 1.1875000382133294e-05, 6.671874871244654e-05, 0.0001734374964144081, 0.00037664061528630555, 0.0005010937456972897, 0.0007093750173225999, 0.0011590624926611781, 0.0014403124805539846, 0.001910234335809946, 0.0020442968234419823, 0.002479375107213855, 0.002171406289562583, 0.0017252343241125345, 0.001215156284160912, 0.0007388281519524753, 0.0003538281307555735, 0.000204140626010485, 9.039062570082024e-05, 7.085937249939889e-05, 9.375000445288606e-06, 0.0, 0.0, 0.0, 0.0]]]}]", 
        "__shape__": "(1, 28, 28)"
      }, 
      "inputs": []
    }, 
    {
      "op": "BlockGrad", 
      "name": "blockgrad1", 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div0", 
      "inputs": [[3, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1__weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1__bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "20", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool1_", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2__weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2__bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_", 
      "attrs": {
        "kernel": "(5, 5)", 
        "no_bias": "False", 
        "num_filter": "50", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pool2_", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten0", 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc2__weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc2__bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc2_", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "500"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc3__weight", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc3__bias", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc3_", 
      "attrs": {
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[22, 0, 0], [23, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    7, 
    8, 
    11, 
    12, 
    16, 
    17, 
    20, 
    21, 
    23
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    12, 
    13, 
    14, 
    15, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27
  ], 
  "heads": [[24, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10800]}
}