{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "padding0_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.5"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "padding1_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.5"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(16,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "tanh0_fwd", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "vectorquantize0_swapaxes0", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "vectorquantize0_swapaxes1", 
      "attrs": {
        "dim1": "2", 
        "dim2": "3"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "vectorquantize0_reshape0", 
      "attrs": {"shape": "(-1, 16)"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "vectorquantize0__powerscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "vectorquantize0_sum0", 
      "attrs": {
        "axis": "1", 
        "keepdims": "True"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vectorquantize0_embeddings", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"uniform\", {\"scale\": 0.07}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 16)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "transpose", 
      "name": "vectorquantize0_transpose0", 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "vectorquantize0_dot0", 
      "inputs": [[19, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "broadcast_like", 
      "name": "vectorquantize0_broadcast_like0", 
      "inputs": [[21, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vectorquantize0__mulscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vectorquantize0__minus0", 
      "inputs": [[25, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "vectorquantize0__powerscalar1", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "vectorquantize0_sum1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "vectorquantize0_expand_dims0", 
      "attrs": {"axis": "0"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "broadcast_like", 
      "name": "vectorquantize0_broadcast_like1", 
      "inputs": [[30, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "vectorquantize0__plus0", 
      "inputs": [[27, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "argmin", 
      "name": "vectorquantize0_argmin0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "one_hot", 
      "name": "vectorquantize0_one_hot0", 
      "attrs": {"depth": "64"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "dot", 
      "name": "vectorquantize0_dot1", 
      "inputs": [[34, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "reshape_like", 
      "name": "vectorquantize0_reshape_like0", 
      "inputs": [[35, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "vectorquantize0__plus1", 
      "inputs": [[18, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "vectorquantize0_stop_gradient2", 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vectorquantize0__minus3", 
      "inputs": [[18, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "vectorquantize0_swapaxes2", 
      "attrs": {
        "dim1": "3", 
        "dim2": "2"
      }, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "vectorquantize0_swapaxes3", 
      "attrs": {
        "dim1": "2", 
        "dim2": "1"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "_copy", 
      "name": "identity0", 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "vectorquantize0_stop_gradient0", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vectorquantize0__minus1", 
      "inputs": [[43, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "vectorquantize0__powerscalar2", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "vectorquantize0_mean0", 
      "attrs": {
        "axis": "0", 
        "exclude": "True"
      }, 
      "inputs": [[45, 0, 0]]
    }, 
    {
      "op": "BlockGrad", 
      "name": "vectorquantize0_stop_gradient1", 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vectorquantize0__minus2", 
      "inputs": [[36, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "vectorquantize0__powerscalar3", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "vectorquantize0_mean1", 
      "attrs": {
        "axis": "0", 
        "exclude": "True"
      }, 
      "inputs": [[49, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 2, 3, 8, 9, 13, 14, 22], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53
  ], 
  "heads": [[42, 0, 0], [46, 0, 0], [50, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10800]}
}