{
  "nodes": [
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vaeloss0__minus2", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "_power_scalar", 
      "name": "vaeloss0__powerscalar0", 
      "attrs": {"scalar": "2"}, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "vaeloss0_sum1", 
      "attrs": {
        "axis": "0", 
        "exclude": "True"
      }, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data3", 
      "inputs": []
    }, 
    {
      "op": "_plus_scalar", 
      "name": "vaeloss0__plusscalar0", 
      "attrs": {"scalar": "1"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "elemwise_mul", 
      "name": "vaeloss0__mul0", 
      "inputs": [[7, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vaeloss0__minus0", 
      "inputs": [[6, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "exp", 
      "name": "vaeloss0_exp0", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "elemwise_sub", 
      "name": "vaeloss0__minus1", 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "sum", 
      "name": "vaeloss0_sum0", 
      "attrs": {
        "axis": "0", 
        "exclude": "True"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vaeloss0__mulscalar0", 
      "attrs": {"scalar": "0.5"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "vaeloss0__mulscalar1", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "vaeloss0__plusscalar1", 
      "attrs": {"scalar": "0"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "vaeloss0__plus0", 
      "inputs": [[4, 0, 0], [15, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 5, 7], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17
  ], 
  "heads": [[16, 0, 0], [4, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10800]}
}