{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "_plus_scalar", 
      "name": "sigmoidbinarycrossentropyloss0__plusscalar0", 
      "attrs": {"scalar": "1e-12"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "sigmoidbinarycrossentropyloss0_log0", 
      "inputs": [[1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "reshape_like", 
      "name": "sigmoidbinarycrossentropyloss0_reshape_like0", 
      "inputs": [[3, 0, 0], [0, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "sigmoidbinarycrossentropyloss0__mul0", 
      "inputs": [[2, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "sigmoidbinarycrossentropyloss0__rminusscalar0", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "_plus_scalar", 
      "name": "sigmoidbinarycrossentropyloss0__plusscalar1", 
      "attrs": {"scalar": "1e-12"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "log", 
      "name": "sigmoidbinarycrossentropyloss0_log1", 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "_rminus_scalar", 
      "name": "sigmoidbinarycrossentropyloss0__rminusscalar1", 
      "attrs": {"scalar": "1.0"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "elemwise_mul", 
      "name": "sigmoidbinarycrossentropyloss0__mul1", 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "sigmoidbinarycrossentropyloss0__plus0", 
      "inputs": [[5, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "_mul_scalar", 
      "name": "sigmoidbinarycrossentropyloss0__mulscalar0", 
      "attrs": {"scalar": "-1.0"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "mean", 
      "name": "sigmoidbinarycrossentropyloss0_mean0", 
      "attrs": {
        "axis": "0", 
        "exclude": "True"
      }, 
      "inputs": [[12, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 3], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14
  ], 
  "heads": [[13, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10600]}
}