{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "word_embed.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(50265, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "node_0", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "float32", 
        "input_dim": "50265", 
        "output_dim": "768", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "pos_embed._embed.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(512, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "_contrib_arange_like", 
      "name": "node_1", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "take", 
      "name": "node_2", 
      "attrs": {
        "axis": "0", 
        "mode": "clip"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_3", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "0"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_4", 
      "inputs": [[2, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "embed_ln.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_ln.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_5", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_6", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.attn_qkv.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.attn_qkv.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_17", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "_split_v2", 
      "name": "node_18", 
      "attrs": {
        "axis": "-1", 
        "indices": "[]", 
        "sections": "3", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_19", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_24", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_20", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[15, 1, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_25", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_26", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "transpose_b": "True"
      }, 
      "inputs": [[17, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "_contrib_arange_like", 
      "name": "node_8", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_9", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(1, 1, -1)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": []
    }, 
    {
      "op": "Cast", 
      "name": "node_7", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "float32"
      }, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_10", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, 1, 1)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_npi_less", 
      "name": "node_11", 
      "inputs": [[22, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_12", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(1, -1, 1)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_13", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, 1, 1)"
      }, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "_npi_less", 
      "name": "node_14", 
      "inputs": [[27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "_npi_multiply", 
      "name": "node_15", 
      "inputs": [[26, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_16", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_22", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_23", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_27", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "masked_softmax", 
      "name": "node_28", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "temperature": "8.0"
      }, 
      "inputs": [[20, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_29", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "p": "0.1"
      }, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_21", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[15, 2, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_30", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_31", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": [[36, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "_npi_transpose", 
      "name": "node_32", 
      "attrs": {"axes": "[0,2,1,3]"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_33", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, -1)"
      }, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.attention_proj.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.attention_proj.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_34", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_35", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_36", 
      "inputs": [[45, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_37", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.ffn_1.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.ffn_1.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_38", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "node_39", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "act_type": "gelu"
      }, 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "_npi_copy", 
      "name": "node_40", 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.ffn_2.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.ffn_2.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_41", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_42", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_43", 
      "inputs": [[58, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.0.ffn.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_44", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[59, 0, 0], [60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.attn_qkv.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.attn_qkv.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_45", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "_split_v2", 
      "name": "node_46", 
      "attrs": {
        "axis": "-1", 
        "indices": "[]", 
        "sections": "3", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[65, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_47", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_52", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_48", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[66, 1, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_53", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_54", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "transpose_b": "True"
      }, 
      "inputs": [[68, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_50", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_51", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_55", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "masked_softmax", 
      "name": "node_56", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "temperature": "8.0"
      }, 
      "inputs": [[71, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_57", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "p": "0.1"
      }, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_49", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[66, 2, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_58", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_59", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": [[76, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "_npi_transpose", 
      "name": "node_60", 
      "attrs": {"axes": "[0,2,1,3]"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_61", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, -1)"
      }, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.attention_proj.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.attention_proj.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_62", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[81, 0, 0], [82, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_63", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_64", 
      "inputs": [[85, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_65", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[86, 0, 0], [87, 0, 0], [88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.ffn_1.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.ffn_1.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_66", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0], [91, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "node_67", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "act_type": "gelu"
      }, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "_npi_copy", 
      "name": "node_68", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.ffn_2.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.ffn_2.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_69", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_70", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_71", 
      "inputs": [[98, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.1.ffn.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_72", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.attn_qkv.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.attn_qkv.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_73", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "_split_v2", 
      "name": "node_74", 
      "attrs": {
        "axis": "-1", 
        "indices": "[]", 
        "sections": "3", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[105, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_75", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_80", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[107, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_76", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[106, 1, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_81", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_82", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "transpose_b": "True"
      }, 
      "inputs": [[108, 0, 0], [110, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_78", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_79", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_83", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "masked_softmax", 
      "name": "node_84", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "temperature": "8.0"
      }, 
      "inputs": [[111, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_85", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "p": "0.1"
      }, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_77", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[106, 2, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_86", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[117, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_87", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": [[116, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "_npi_transpose", 
      "name": "node_88", 
      "attrs": {"axes": "[0,2,1,3]"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_89", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, -1)"
      }, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.attention_proj.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.attention_proj.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_90", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_91", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[124, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_92", 
      "inputs": [[125, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_93", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.ffn_1.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.ffn_1.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_94", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "node_95", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "act_type": "gelu"
      }, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "_npi_copy", 
      "name": "node_96", 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.ffn_2.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.ffn_2.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_97", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_98", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[137, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_99", 
      "inputs": [[138, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.2.ffn.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_100", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.attn_qkv.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.attn_qkv.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_101", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "_split_v2", 
      "name": "node_102", 
      "attrs": {
        "axis": "-1", 
        "indices": "[]", 
        "sections": "3", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_103", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[146, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_108", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_104", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[146, 1, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_109", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[149, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_110", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "transpose_b": "True"
      }, 
      "inputs": [[148, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_106", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_107", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_111", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[153, 0, 0]]
    }, 
    {
      "op": "masked_softmax", 
      "name": "node_112", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "temperature": "8.0"
      }, 
      "inputs": [[151, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_113", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "p": "0.1"
      }, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_105", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[146, 2, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_114", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_115", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": [[156, 0, 0], [158, 0, 0]]
    }, 
    {
      "op": "_npi_transpose", 
      "name": "node_116", 
      "attrs": {"axes": "[0,2,1,3]"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_117", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, -1)"
      }, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.attention_proj.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.attention_proj.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_118", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_119", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[164, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_120", 
      "inputs": [[165, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_121", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[166, 0, 0], [167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.ffn_1.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.ffn_1.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(3072,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_122", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "3072"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "node_123", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "act_type": "gelu"
      }, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "_npi_copy", 
      "name": "node_124", 
      "inputs": [[173, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.ffn_2.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 3072)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.ffn_2.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_125", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "768"
      }, 
      "inputs": [[174, 0, 0], [175, 0, 0], [176, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_126", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.1"
      }, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "_npi_add", 
      "name": "node_127", 
      "inputs": [[178, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.layer_norm.gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.3.ffn.layer_norm.beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "LayerNorm", 
      "name": "node_128", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "eps": "1e-05"
      }, 
      "inputs": [[179, 0, 0], [180, 0, 0], [181, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.4.attn_qkv.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.4.attn_qkv.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(2304,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "node_129", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "2304"
      }, 
      "inputs": [[182, 0, 0], [183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "_split_v2", 
      "name": "node_130", 
      "attrs": {
        "axis": "-1", 
        "indices": "[]", 
        "sections": "3", 
        "squeeze_axis": "0"
      }, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_131", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[186, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_136", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_132", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[186, 1, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_137", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_138", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "transpose_b": "True"
      }, 
      "inputs": [[188, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "expand_dims", 
      "name": "node_134", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "1"
      }, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_135", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "Cast", 
      "name": "node_139", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dtype": "bool"
      }, 
      "inputs": [[193, 0, 0]]
    }, 
    {
      "op": "masked_softmax", 
      "name": "node_140", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "axis": "-1", 
        "temperature": "8.0"
      }, 
      "inputs": [[191, 0, 0], [194, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "node_141", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "p": "0.1"
      }, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_133", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, 12, -1)"
      }, 
      "inputs": [[186, 2, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "node_142", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "node_143", 
      "attrs": {"__profiler_scope__": "<unk>:"}, 
      "inputs": [[196, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "_npi_transpose", 
      "name": "node_144", 
      "attrs": {"axes": "[0,2,1,3]"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "_npx_reshape", 
      "name": "node_145", 
      "attrs": {
        "__profiler_scope__": "<unk>:", 
        "newshape": "(-2, -2, -1)"
      }, 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.4.attention_proj.weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"truncnorm\", {}]", 
        "__lr_mult__": "1.0", 
        "__profiler_scope__": "<unk>:", 
        "__shape__": "(768, 768)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "encoder.all_layers.4.attention_proj.bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"zero\", {}]", 
