{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(50, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(50,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense3_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "50"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense4_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.5"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(400,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense5_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "400"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout3_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.5"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "dense6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(784, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "dense6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(784,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "dense6_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "784"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Reshape", 
      "name": "reshape0", 
      "attrs": {"shape": "(0, 1, 28, 28)"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid0_fwd", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "_copy", 
      "name": "identity1", 
      "inputs": [[18, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 4, 5, 9, 10, 14, 15], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    13, 
    14, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22
  ], 
  "heads": [[19, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10700]}
}