{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding0_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[0, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_00_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding1_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "net_00_pool0_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding2_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_00_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding3_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "net_00_pool1_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding4_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_00_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding5_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "net_00_pool2_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding6_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 1, 1, 1)"
      }, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_00_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "Pad", 
      "name": "net_00_padding7_pad0", 
      "attrs": {
        "constant_value": "0", 
        "mode": "constant", 
        "pad_width": "(0, 0, 0, 0, 1, 0, 1, 0)"
      }, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "net_00_pool3_fwd", 
      "attrs": {
        "global_pool": "False", 
        "kernel": "(2, 2)", 
        "layout": "NCHW", 
        "pad": "(0, 0)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(500, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(500,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv4_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "500", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_00_relu4_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "net_00_dropout0_fwd", 
      "attrs": {
        "axes": "()", 
        "cudnn_off": "False", 
        "p": "0.25"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_conv5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "net_00_conv5_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "10", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "net_00_softmax0", 
      "attrs": {"axis": "-1"}, 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "_copy", 
      "name": "net_00_identity0", 
      "inputs": [[37, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    9, 
    10, 
    16, 
    17, 
    23, 
    24, 
    29, 
    30, 
    34, 
    35
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40
  ], 
  "heads": [[38, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10501]}
}