{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_10_zscorenormalization0_data_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": [[[108.30000305175781, 98.4000015258789, 101.80000305175781, 106.80000305175781, 110.4000015258789, 118.0, 131.39999389648438, 135.3000030517578, 128.3000030517578, 114.0999984741211, 105.19999694824219, 104.30000305175781, 104.0999984741211, 105.9000015258789, 109.0, 112.4000015258789, 116.69999694824219, 113.9000015258789, 114.5999984741211, 121.4000015258789, 119.19999694824219, 114.0999984741211, 112.5999984741211, 114.4000015258789, 118.4000015258789, 119.5, 118.80000305175781, 117.0999984741211, 119.5999984741211, 119.80000305175781, 118.30000305175781, 112.30000305175781], [105.0, 98.9000015258789, 97.19999694824219, 106.69999694824219, 111.30000305175781, 116.5999984741211, 128.0, 131.0, 127.0, 118.0999984741211, 114.30000305175781, 112.19999694824219, 107.9000015258789, 106.0999984741211, 109.0, 115.0, 117.4000015258789, 116.19999694824219, 115.4000015258789, 119.5, 116.30000305175781, 112.19999694824219, 109.4000015258789, 104.4000015258789, 109.0, 110.9000015258789, 109.69999694824219, 114.9000015258789, 118.80000305175781, 121.0, 113.5999984741211, 110.5], [106.80000305175781, 97.9000015258789, 95.4000015258789, 106.30000305175781, 106.5, 103.69999694824219, 113.0999984741211, 120.5999984741211, 119.4000015258789, 123.30000305175781, 129.6999969482422, 122.30000305175781, 116.19999694824219, 115.0, 116.80000305175781, 128.3000030517578, 133.1999969482422, 132.6999969482422, 127.30000305175781, 127.80000305175781, 126.0, 121.4000015258789, 122.0, 109.5, 108.80000305175781, 109.9000015258789, 107.5, 111.19999694824219, 110.19999694824219, 112.0999984741211, 109.4000015258789, 108.9000015258789], [100.5, 97.9000015258789, 98.80000305175781, 98.4000015258789, 99.4000015258789, 105.9000015258789, 106.5, 112.5, 115.30000305175781, 118.5999984741211, 117.4000015258789, 109.5999984741211, 107.80000305175781, 110.80000305175781, 120.0, 129.1999969482422, 140.3000030517578, 152.6999969482422, 152.3000030517578, 135.6999969482422, 134.60000610351562, 132.10000610351562, 129.8000030517578, 129.39999389648438, 122.9000015258789, 112.30000305175781, 109.4000015258789, 108.5999984741211, 105.30000305175781, 105.5999984741211, 105.4000015258789, 104.5999984741211], [94.19999694824219, 97.5, 100.0999984741211, 97.30000305175781, 97.0999984741211, 106.80000305175781, 103.4000015258789, 103.5, 105.5999984741211, 107.0, 105.0, 101.0, 97.30000305175781, 93.0999984741211, 113.5999984741211, 139.60000610351562, 154.5, 154.5, 148.39999389648438, 133.60000610351562, 129.10000610351562, 131.8000030517578, 131.3000030517578, 136.0, 132.10000610351562, 118.30000305175781, 106.80000305175781, 104.5999984741211, 101.5999984741211, 101.9000015258789, 102.19999694824219, 103.0999984741211], [99.80000305175781, 95.19999694824219, 92.0, 91.69999694824219, 92.0, 102.4000015258789, 103.0, 98.19999694824219, 102.4000015258789, 108.5, 106.4000015258789, 105.5999984741211, 91.0999984741211, 82.5999984741211, 98.4000015258789, 129.0, 147.8000030517578, 150.1999969482422, 150.89999389648438, 147.10000610351562, 142.10000610351562, 137.8000030517578, 135.6999969482422, 129.10000610351562, 126.80000305175781, 119.80000305175781, 106.69999694824219, 97.9000015258789, 97.9000015258789, 101.30000305175781, 99.5999984741211, 100.30000305175781], [104.0999984741211, 94.0, 87.0999984741211, 88.9000015258789, 97.0, 101.80000305175781, 103.9000015258789, 104.5999984741211, 100.5, 98.69999694824219, 96.30000305175781, 93.80000305175781, 87.5999984741211, 85.0999984741211, 97.0999984741211, 115.4000015258789, 129.0, 136.8000030517578, 134.5, 134.3000030517578, 135.1999969482422, 129.5, 124.19999694824219, 113.0, 119.5, 125.30000305175781, 118.69999694824219, 105.9000015258789, 105.0999984741211, 112.5, 111.0999984741211, 111.5999984741211], [107.0999984741211, 91.69999694824219, 83.4000015258789, 97.9000015258789, 99.69999694824219, 95.0, 92.30000305175781, 95.30000305175781, 93.5999984741211, 90.0999984741211, 92.4000015258789, 85.9000015258789, 84.5999984741211, 85.9000015258789, 93.19999694824219, 108.80000305175781, 125.30000305175781, 128.60000610351562, 124.0, 129.5, 132.3000030517578, 127.30000305175781, 126.5, 118.5, 118.19999694824219, 118.69999694824219, 120.19999694824219, 109.69999694824219, 105.80000305175781, 116.4000015258789, 115.4000015258789, 113.4000015258789], [108.9000015258789, 90.5999984741211, 81.4000015258789, 94.5, 96.4000015258789, 95.19999694824219, 97.5999984741211, 97.4000015258789, 95.80000305175781, 95.80000305175781, 97.5, 99.0999984741211, 98.5, 99.19999694824219, 99.19999694824219, 109.0, 124.80000305175781, 133.8000030517578, 132.5, 139.8000030517578, 127.69999694824219, 108.0999984741211, 129.39999389648438, 130.0, 113.19999694824219, 111.19999694824219, 108.69999694824219, 97.9000015258789, 82.5, 93.80000305175781, 98.0999984741211, 99.9000015258789], [101.0, 94.19999694824219, 95.80000305175781, 105.30000305175781, 104.80000305175781, 106.0999984741211, 105.4000015258789, 102.5, 99.5999984741211, 101.4000015258789, 98.69999694824219, 105.4000015258789, 107.69999694824219, 105.19999694824219, 102.69999694824219, 113.4000015258789, 126.5999984741211, 135.8000030517578, 138.0, 137.1999969482422, 127.19999694824219, 106.30000305175781, 115.69999694824219, 122.69999694824219, 112.5, 106.30000305175781, 97.5999984741211, 89.4000015258789, 71.5, 75.69999694824219, 78.19999694824219, 81.80000305175781], [105.19999694824219, 101.69999694824219, 106.19999694824219, 110.80000305175781, 107.4000015258789, 107.5, 107.5, 105.4000015258789, 106.4000015258789, 106.69999694824219, 99.5, 104.30000305175781, 102.5, 105.0, 104.80000305175781, 108.9000015258789, 123.0999984741211, 128.5, 129.1999969482422, 133.8000030517578, 128.89999389648438, 111.5999984741211, 103.9000015258789, 111.30000305175781, 111.0, 106.4000015258789, 91.9000015258789, 86.0999984741211, 74.19999694824219, 72.80000305175781, 75.0999984741211, 78.69999694824219], [104.30000305175781, 100.69999694824219, 106.5, 110.9000015258789, 112.19999694824219, 114.0999984741211, 114.0999984741211, 107.0, 106.80000305175781, 104.69999694824219, 104.19999694824219, 107.80000305175781, 109.5, 117.4000015258789, 111.0999984741211, 111.69999694824219, 121.0999984741211, 124.5, 125.19999694824219, 127.0999984741211, 129.5, 110.4000015258789, 105.4000015258789, 108.0, 106.30000305175781, 109.0999984741211, 104.30000305175781, 100.80000305175781, 87.4000015258789, 77.0, 80.80000305175781, 85.69999694824219], [103.4000015258789, 103.5999984741211, 101.80000305175781, 101.5, 106.9000015258789, 111.80000305175781, 109.80000305175781, 101.0999984741211, 101.5999984741211, 100.30000305175781, 105.0999984741211, 108.5, 107.30000305175781, 116.5, 119.80000305175781, 119.30000305175781, 119.0, 123.5999984741211, 127.0999984741211, 129.8000030517578, 128.10000610351562, 110.0, 100.0999984741211, 104.5999984741211, 106.0, 107.30000305175781, 107.0, 109.30000305175781, 98.5, 81.69999694824219, 85.9000015258789, 95.0], [106.19999694824219, 115.5999984741211, 105.4000015258789, 105.80000305175781, 110.5999984741211, 115.69999694824219, 111.80000305175781, 110.80000305175781, 102.9000015258789, 104.80000305175781, 115.69999694824219, 124.0, 118.5999984741211, 126.80000305175781, 137.89999389648438, 130.1999969482422, 119.9000015258789, 124.19999694824219, 138.39999389648438, 140.10000610351562, 131.10000610351562, 116.69999694824219, 110.30000305175781, 112.69999694824219, 107.19999694824219, 101.5999984741211, 97.19999694824219, 100.0999984741211, 99.4000015258789, 91.0, 88.4000015258789, 93.19999694824219], [102.80000305175781, 110.5999984741211, 103.5999984741211, 109.30000305175781, 117.80000305175781, 117.30000305175781, 122.0, 121.9000015258789, 111.4000015258789, 113.9000015258789, 130.8000030517578, 137.8000030517578, 133.10000610351562, 137.3000030517578, 143.39999389648438, 139.3000030517578, 137.39999389648438, 133.10000610351562, 143.5, 137.60000610351562, 123.9000015258789, 121.0999984741211, 117.69999694824219, 115.4000015258789, 107.69999694824219, 93.5, 89.19999694824219, 91.30000305175781, 86.4000015258789, 85.0, 90.0, 89.4000015258789], [104.9000015258789, 114.9000015258789, 116.80000305175781, 129.10000610351562, 137.60000610351562, 131.5, 136.1999969482422, 134.5, 139.5, 143.3000030517578, 139.10000610351562, 137.6999969482422, 137.10000610351562, 129.8000030517578, 129.60000610351562, 140.10000610351562, 138.89999389648438, 139.1999969482422, 133.60000610351562, 132.1999969482422, 122.5, 115.19999694824219, 115.5999984741211, 115.5999984741211, 107.19999694824219, 91.30000305175781, 93.80000305175781, 88.30000305175781, 78.4000015258789, 80.30000305175781, 90.69999694824219, 96.80000305175781], [120.9000015258789, 131.1999969482422, 145.6999969482422, 156.60000610351562, 156.6999969482422, 154.1999969482422, 156.39999389648438, 153.0, 163.10000610351562, 169.60000610351562, 150.0, 140.3000030517578, 140.89999389648438, 129.60000610351562, 131.60000610351562, 137.5, 125.5, 121.0, 118.9000015258789, 116.5, 114.5, 102.9000015258789, 111.80000305175781, 129.5, 116.5999984741211, 99.30000305175781, 106.19999694824219, 90.5, 74.19999694824219, 80.9000015258789, 86.19999694824219, 97.30000305175781], [126.9000015258789, 143.60000610351562, 160.10000610351562, 165.5, 162.1999969482422, 167.60000610351562, 161.89999389648438, 158.5, 170.0, 176.3000030517578, 154.89999389648438, 141.60000610351562, 144.3000030517578, 135.39999389648438, 133.10000610351562, 127.0999984741211, 112.9000015258789, 103.9000015258789, 113.19999694824219, 114.80000305175781, 113.0, 102.0, 113.0999984741211, 138.10000610351562, 124.4000015258789, 106.5999984741211, 113.80000305175781, 102.0, 77.80000305175781, 70.30000305175781, 82.69999694824219, 98.0], [137.1999969482422, 149.3000030517578, 154.89999389648438, 158.0, 159.39999389648438, 162.3000030517578, 154.8000030517578, 160.8000030517578, 166.3000030517578, 169.0, 152.8000030517578, 140.10000610351562, 135.1999969482422, 137.6999969482422, 132.1999969482422, 121.5999984741211, 111.0, 109.69999694824219, 114.80000305175781, 116.9000015258789, 116.5999984741211, 115.0, 119.19999694824219, 128.89999389648438, 120.69999694824219, 99.5, 101.19999694824219, 98.4000015258789, 82.69999694824219, 67.0999984741211, 77.0, 97.69999694824219], [130.60000610351562, 136.5, 138.60000610351562, 136.8000030517578, 135.60000610351562, 139.0, 137.3000030517578, 142.6999969482422, 146.89999389648438, 148.10000610351562, 139.60000610351562, 126.9000015258789, 122.4000015258789, 126.5999984741211, 122.5, 119.4000015258789, 114.5, 120.80000305175781, 123.0999984741211, 119.69999694824219, 119.5999984741211, 119.30000305175781, 124.5, 121.19999694824219, 113.69999694824219, 89.19999694824219, 78.80000305175781, 84.69999694824219, 83.80000305175781, 71.5999984741211, 84.5999984741211, 99.19999694824219], [117.4000015258789, 124.5, 129.1999969482422, 120.30000305175781, 122.4000015258789, 135.0, 133.0, 131.8000030517578, 138.8000030517578, 144.1999969482422, 133.6999969482422, 125.69999694824219, 124.9000015258789, 124.80000305175781, 128.60000610351562, 128.5, 117.0999984741211, 116.19999694824219, 115.80000305175781, 115.5999984741211, 105.0, 97.19999694824219, 103.30000305175781, 106.19999694824219, 98.9000015258789, 84.4000015258789, 84.30000305175781, 92.19999694824219, 90.4000015258789, 75.80000305175781, 94.5999984741211, 104.69999694824219], [126.80000305175781, 131.10000610351562, 132.89999389648438, 119.19999694824219, 131.8000030517578, 150.3000030517578, 131.0, 119.69999694824219, 138.5, 147.3000030517578, 131.6999969482422, 128.10000610351562, 126.5999984741211, 124.0999984741211, 130.3000030517578, 136.10000610351562, 126.4000015258789, 113.80000305175781, 107.5999984741211, 96.69999694824219, 84.9000015258789, 76.19999694824219, 71.0, 80.69999694824219, 88.5999984741211, 82.5999984741211, 95.80000305175781, 101.0999984741211, 93.0, 78.5, 100.0, 114.30000305175781], [135.0, 131.1999969482422, 137.5, 128.60000610351562, 136.1999969482422, 143.0, 129.1999969482422, 119.9000015258789, 127.19999694824219, 131.3000030517578, 123.30000305175781, 124.69999694824219, 113.9000015258789, 108.80000305175781, 114.0, 114.19999694824219, 104.0999984741211, 94.30000305175781, 93.9000015258789, 85.69999694824219, 85.80000305175781, 86.5, 70.0999984741211, 75.4000015258789, 81.30000305175781, 73.0, 92.5999984741211, 98.0, 85.4000015258789, 79.5, 100.0, 114.0], [138.0, 128.0, 134.8000030517578, 130.1999969482422, 127.9000015258789, 135.0, 124.80000305175781, 110.30000305175781, 114.30000305175781, 119.30000305175781, 122.4000015258789, 128.0, 117.5999984741211, 114.30000305175781, 103.0, 89.0, 82.19999694824219, 85.4000015258789, 81.0999984741211, 82.9000015258789, 95.30000305175781, 108.0, 93.19999694824219, 82.80000305175781, 75.80000305175781, 62.20000076293945, 75.69999694824219, 82.30000305175781, 75.80000305175781, 70.0999984741211, 89.0, 108.5999984741211], [139.6999969482422, 126.5999984741211, 126.19999694824219, 120.5, 122.4000015258789, 130.8000030517578, 114.30000305175781, 102.19999694824219, 114.30000305175781, 122.5, 120.19999694824219, 123.5999984741211, 115.0, 100.69999694824219, 88.0999984741211, 85.0999984741211, 84.5999984741211, 88.4000015258789, 76.4000015258789, 83.9000015258789, 104.19999694824219, 106.5999984741211, 99.9000015258789, 88.5999984741211, 86.19999694824219, 74.0999984741211, 71.9000015258789, 69.4000015258789, 70.0, 66.69999694824219, 83.5, 105.0999984741211], [131.10000610351562, 121.5999984741211, 122.30000305175781, 114.5, 113.9000015258789, 112.69999694824219, 111.19999694824219, 108.5999984741211, 114.4000015258789, 121.80000305175781, 114.9000015258789, 106.5, 97.0999984741211, 94.19999694824219, 81.9000015258789, 78.5, 89.4000015258789, 97.0, 86.80000305175781, 86.69999694824219, 107.30000305175781, 111.5, 101.9000015258789, 84.30000305175781, 79.0, 82.0, 80.69999694824219, 73.5, 71.19999694824219, 73.4000015258789, 86.0999984741211, 94.5999984741211], [127.69999694824219, 119.0999984741211, 111.9000015258789, 102.69999694824219, 103.5, 101.4000015258789, 104.19999694824219, 110.5, 115.30000305175781, 121.5, 117.4000015258789, 108.69999694824219, 100.69999694824219, 109.0, 105.4000015258789, 87.5999984741211, 88.4000015258789, 101.69999694824219, 93.4000015258789, 85.4000015258789, 105.9000015258789, 116.69999694824219, 98.9000015258789, 76.69999694824219, 70.0, 76.69999694824219, 74.30000305175781, 74.80000305175781, 76.19999694824219, 73.5999984741211, 79.5999984741211, 82.0], [119.9000015258789, 106.0999984741211, 96.0999984741211, 87.0999984741211, 88.80000305175781, 90.5999984741211, 99.69999694824219, 109.9000015258789, 111.4000015258789, 122.4000015258789, 120.9000015258789, 113.30000305175781, 103.19999694824219, 105.5999984741211, 109.19999694824219, 99.30000305175781, 98.80000305175781, 104.9000015258789, 98.80000305175781, 85.5999984741211, 91.19999694824219, 94.69999694824219, 83.69999694824219, 74.0999984741211, 70.19999694824219, 73.19999694824219, 64.69999694824219, 70.0999984741211, 78.9000015258789, 77.69999694824219, 76.80000305175781, 78.5999984741211], [111.5999984741211, 98.80000305175781, 97.4000015258789, 88.4000015258789, 86.9000015258789, 88.30000305175781, 101.19999694824219, 110.0999984741211, 115.69999694824219, 119.4000015258789, 112.0, 114.5, 110.0, 109.30000305175781, 102.4000015258789, 97.0999984741211, 107.5, 111.19999694824219, 102.30000305175781, 93.0999984741211, 92.9000015258789, 86.9000015258789, 85.4000015258789, 84.4000015258789, 83.5999984741211, 79.5, 68.80000305175781, 74.80000305175781, 74.5, 74.19999694824219, 69.30000305175781, 75.69999694824219], [106.5999984741211, 98.5, 98.5999984741211, 92.0999984741211, 95.30000305175781, 96.0, 99.5, 107.0, 115.30000305175781, 112.4000015258789, 114.19999694824219, 117.9000015258789, 116.19999694824219, 114.9000015258789, 108.9000015258789, 106.5999984741211, 107.0, 109.80000305175781, 102.5999984741211, 101.80000305175781, 104.5, 97.5, 88.5, 85.80000305175781, 87.30000305175781, 79.0999984741211, 70.5, 71.80000305175781, 74.69999694824219, 73.69999694824219, 70.5, 81.4000015258789], [103.5, 100.80000305175781, 101.0999984741211, 97.19999694824219, 95.5999984741211, 95.69999694824219, 98.30000305175781, 102.4000015258789, 108.19999694824219, 112.30000305175781, 122.80000305175781, 119.69999694824219, 113.4000015258789, 107.9000015258789, 105.30000305175781, 105.19999694824219, 102.19999694824219, 100.5999984741211, 98.0999984741211, 96.5999984741211, 101.19999694824219, 99.69999694824219, 91.0999984741211, 82.4000015258789, 81.4000015258789, 77.4000015258789, 74.69999694824219, 76.4000015258789, 83.19999694824219, 84.4000015258789, 82.0999984741211, 86.69999694824219], [110.30000305175781, 111.4000015258789, 108.5999984741211, 104.5, 97.69999694824219, 97.19999694824219, 95.30000305175781, 100.5, 107.19999694824219, 110.4000015258789, 111.19999694824219, 107.5, 105.30000305175781, 99.30000305175781, 91.4000015258789, 94.5, 99.9000015258789, 99.0, 98.30000305175781, 91.0, 93.4000015258789, 94.9000015258789, 92.19999694824219, 86.30000305175781, 84.5999984741211, 85.4000015258789, 81.80000305175781, 82.0999984741211, 86.4000015258789, 90.0999984741211, 84.0999984741211, 83.9000015258789]], [[116.19999694824219, 102.5999984741211, 104.19999694824219, 110.19999694824219, 114.5, 121.5, 131.89999389648438, 134.10000610351562, 128.5, 116.5999984741211, 110.80000305175781, 114.69999694824219, 119.80000305175781, 122.4000015258789, 123.80000305175781, 126.69999694824219, 129.10000610351562, 127.0999984741211, 129.60000610351562, 135.0, 132.3000030517578, 128.6999969482422, 125.30000305175781, 123.0999984741211, 124.30000305175781, 123.5999984741211, 123.0, 122.30000305175781, 125.0999984741211, 126.5999984741211, 125.19999694824219, 118.69999694824219], [113.0999984741211, 105.5999984741211, 101.0999984741211, 109.19999694824219, 115.4000015258789, 120.69999694824219, 129.6999969482422, 130.60000610351562, 127.5999984741211, 122.69999694824219, 124.9000015258789, 128.0, 125.80000305175781, 122.80000305175781, 124.80000305175781, 131.39999389648438, 134.0, 133.1999969482422, 134.8000030517578, 138.1999969482422, 131.10000610351562, 125.19999694824219, 121.4000015258789, 114.19999694824219, 116.69999694824219, 119.0, 118.19999694824219, 124.5, 128.60000610351562, 130.39999389648438, 123.80000305175781, 120.0], [114.9000015258789, 107.0, 102.0999984741211, 109.9000015258789, 111.4000015258789, 108.9000015258789, 115.5, 121.0, 121.5999984741211, 132.0, 144.0, 140.3000030517578, 135.5, 133.3000030517578, 132.8000030517578, 145.0, 150.89999389648438, 150.0, 145.89999389648438, 147.8000030517578, 142.39999389648438, 131.10000610351562, 129.89999389648438, 118.0, 118.5, 122.30000305175781, 120.9000015258789, 125.5, 123.5999984741211, 123.19999694824219, 120.9000015258789, 120.69999694824219], [107.80000305175781, 107.0, 106.69999694824219, 104.9000015258789, 108.0, 113.4000015258789, 109.4000015258789, 113.19999694824219, 118.9000015258789, 129.3000030517578, 132.6999969482422, 126.19999694824219, 125.5, 129.39999389648438, 138.39999389648438, 146.1999969482422, 158.0, 169.5, 166.3000030517578, 149.89999389648438, 149.3000030517578, 143.8000030517578, 136.5, 134.1999969482422, 132.89999389648438, 127.19999694824219, 124.30000305175781, 124.4000015258789, 120.4000015258789, 118.5, 118.69999694824219, 117.69999694824219], [101.5, 105.69999694824219, 108.4000015258789, 107.30000305175781, 107.0999984741211, 114.5999984741211, 106.0, 105.80000305175781, 110.69999694824219, 115.19999694824219, 115.5, 113.19999694824219, 111.9000015258789, 110.5, 131.5, 155.0, 170.3000030517578, 169.0, 159.3000030517578, 144.6999969482422, 138.8000030517578, 136.6999969482422, 132.6999969482422, 136.1999969482422, 139.5, 131.5, 119.4000015258789, 117.69999694824219, 114.9000015258789, 115.19999694824219, 115.4000015258789, 116.19999694824219], [108.80000305175781, 104.0, 100.0, 101.5999984741211, 101.0, 109.9000015258789, 107.69999694824219, 104.5, 109.30000305175781, 113.5, 112.30000305175781, 114.30000305175781, 104.0999984741211, 98.5, 114.30000305175781, 142.3000030517578, 161.1999969482422, 161.8000030517578, 159.6999969482422, 156.60000610351562, 146.8000030517578, 132.1999969482422, 129.1999969482422, 122.69999694824219, 128.0, 127.19999694824219, 115.5, 108.30000305175781, 108.69999694824219, 112.4000015258789, 109.5999984741211, 109.9000015258789], [114.30000305175781, 103.9000015258789, 94.5999984741211, 97.0, 106.0999984741211, 111.80000305175781, 115.19999694824219, 117.80000305175781, 112.69999694824219, 107.80000305175781, 105.19999694824219, 102.69999694824219, 98.0999984741211, 97.30000305175781, 110.80000305175781, 127.9000015258789, 141.5, 149.39999389648438, 144.8000030517578, 143.39999389648438, 139.6999969482422, 122.5, 117.5999984741211, 106.69999694824219, 119.19999694824219, 130.6999969482422, 126.19999694824219, 114.5, 113.4000015258789, 121.4000015258789, 120.5, 118.9000015258789], [118.0999984741211, 102.69999694824219, 91.0, 106.0, 107.69999694824219, 105.0999984741211, 104.19999694824219, 108.9000015258789, 107.30000305175781, 102.5, 103.9000015258789, 96.5999984741211, 94.80000305175781, 97.9000015258789, 107.0999984741211, 123.80000305175781, 141.3000030517578, 145.89999389648438, 138.10000610351562, 140.5, 137.8000030517578, 122.80000305175781, 127.5, 121.5, 125.0999984741211, 129.5, 128.39999389648438, 117.30000305175781, 113.9000015258789, 125.69999694824219, 126.0999984741211, 120.69999694824219], [120.80000305175781, 102.30000305175781, 90.30000305175781, 102.80000305175781, 104.4000015258789, 103.9000015258789, 106.9000015258789, 106.69999694824219, 107.19999694824219, 108.4000015258789, 108.80000305175781, 109.30000305175781, 107.5, 110.9000015258789, 112.69999694824219, 123.5, 140.60000610351562, 149.0, 145.10000610351562, 151.3000030517578, 129.39999389648438, 102.9000015258789, 135.8000030517578, 139.8000030517578, 126.9000015258789, 125.69999694824219, 117.69999694824219, 105.4000015258789, 90.19999694824219, 103.4000015258789, 110.4000015258789, 109.80000305175781], [113.0999984741211, 104.5, 102.30000305175781, 112.69999694824219, 114.5999984741211, 115.5, 113.0999984741211, 110.19999694824219, 110.69999694824219, 113.0999984741211, 109.19999694824219, 114.30000305175781, 115.19999694824219, 113.69999694824219, 111.9000015258789, 124.5999984741211, 139.0, 147.39999389648438, 149.10000610351562, 148.39999389648438, 124.0, 101.9000015258789, 127.5, 136.8000030517578, 129.39999389648438, 121.0, 107.5, 96.80000305175781, 78.19999694824219, 85.4000015258789, 92.19999694824219, 94.4000015258789], [115.5, 109.5999984741211, 108.9000015258789, 115.5, 117.80000305175781, 118.19999694824219, 114.9000015258789, 114.0999984741211, 119.0, 117.9000015258789, 110.5999984741211, 115.5999984741211, 112.5, 114.0, 112.9000015258789, 118.69999694824219, 133.8000030517578, 140.0, 140.8000030517578, 141.6999969482422, 121.5, 111.19999694824219, 120.5999984741211, 129.6999969482422, 129.5, 119.19999694824219, 102.69999694824219, 94.30000305175781, 80.0999984741211, 83.19999694824219, 91.4000015258789, 94.80000305175781], [113.0, 107.19999694824219, 109.5, 114.5999984741211, 118.4000015258789, 121.80000305175781, 122.0999984741211, 115.80000305175781, 118.9000015258789, 117.5, 117.19999694824219, 121.80000305175781, 122.5, 128.3000030517578, 121.4000015258789, 123.19999694824219, 133.8000030517578, 138.89999389648438, 139.5, 133.10000610351562, 123.0999984741211, 116.19999694824219, 125.5, 127.80000305175781, 123.9000015258789, 121.0, 114.80000305175781, 108.19999694824219, 91.69999694824219, 87.30000305175781, 97.5999984741211, 101.5], [111.9000015258789, 109.0, 104.19999694824219, 104.30000305175781, 110.80000305175781, 119.0, 119.0, 108.80000305175781, 110.0, 110.80000305175781, 117.5, 123.80000305175781, 123.19999694824219, 128.1999969482422, 128.8000030517578, 131.39999389648438, 135.10000610351562, 141.5, 143.1999969482422, 134.6999969482422, 124.4000015258789, 119.5, 120.0, 123.19999694824219, 125.0999984741211, 122.4000015258789, 120.0999984741211, 118.30000305175781, 103.80000305175781, 92.19999694824219, 101.30000305175781, 107.4000015258789], [114.69999694824219, 119.5, 107.5, 110.4000015258789, 116.9000015258789, 124.69999694824219, 121.9000015258789, 119.0999984741211, 111.5999984741211, 115.5, 127.19999694824219, 136.89999389648438, 132.10000610351562, 135.3000030517578, 140.60000610351562, 136.0, 132.0, 140.10000610351562, 152.10000610351562, 144.8000030517578, 130.5, 125.5, 126.4000015258789, 129.8000030517578, 127.4000015258789, 120.19999694824219, 113.5, 114.0999984741211, 111.9000015258789, 105.0999984741211, 104.5999984741211, 106.0], [111.30000305175781, 114.9000015258789, 108.5999984741211, 118.19999694824219, 129.0, 129.60000610351562, 134.3000030517578, 133.5, 122.5, 125.30000305175781, 139.60000610351562, 144.1999969482422, 139.1999969482422, 141.1999969482422, 142.0, 139.1999969482422, 141.60000610351562, 139.8000030517578, 148.0, 138.5, 124.5, 128.39999389648438, 131.39999389648438, 131.3000030517578, 125.9000015258789, 112.30000305175781, 105.80000305175781, 106.69999694824219, 105.9000015258789, 106.69999694824219, 110.69999694824219, 105.9000015258789], [113.30000305175781, 120.5, 123.0, 139.10000610351562, 149.3000030517578, 142.1999969482422, 146.60000610351562, 144.3000030517578, 148.89999389648438, 150.60000610351562, 141.5, 137.5, 138.60000610351562, 132.10000610351562, 129.60000610351562, 141.10000610351562, 141.60000610351562, 141.39999389648438, 134.0, 131.0, 122.19999694824219, 121.30000305175781, 130.6999969482422, 134.89999389648438, 128.10000610351562, 115.0, 115.19999694824219, 107.5999984741211, 102.9000015258789, 106.30000305175781, 112.30000305175781, 113.69999694824219], [129.0, 138.3000030517578, 153.3000030517578, 166.3000030517578, 166.5, 162.6999969482422, 166.39999389648438, 163.3000030517578, 171.89999389648438, 174.1999969482422, 149.6999969482422, 139.10000610351562, 141.89999389648438, 131.1999969482422, 133.39999389648438, 139.89999389648438, 127.9000015258789, 121.9000015258789, 118.4000015258789, 114.80000305175781, 114.69999694824219, 111.9000015258789, 130.89999389648438, 152.6999969482422, 142.0, 126.19999694824219, 134.0, 118.9000015258789, 103.30000305175781, 110.0999984741211, 109.4000015258789, 114.0999984741211], [134.89999389648438, 152.89999389648438, 170.10000610351562, 175.8000030517578, 171.6999969482422, 176.3000030517578, 172.89999389648438, 169.0, 177.5, 180.10000610351562, 156.10000610351562, 143.60000610351562, 145.60000610351562, 135.10000610351562, 135.10000610351562, 129.89999389648438, 114.9000015258789, 104.30000305175781, 112.69999694824219, 114.19999694824219, 115.80000305175781, 116.30000305175781, 134.60000610351562, 160.1999969482422, 148.1999969482422, 128.6999969482422, 139.6999969482422, 131.39999389648438, 104.9000015258789, 97.5999984741211, 108.0, 117.5], [143.8000030517578, 157.8000030517578, 164.60000610351562, 169.3000030517578, 169.39999389648438, 172.60000610351562, 164.5, 167.6999969482422, 172.1999969482422, 173.39999389648438, 157.1999969482422, 144.39999389648438, 136.1999969482422, 136.5, 134.3000030517578, 126.0999984741211, 115.0999984741211, 113.0, 117.19999694824219, 121.69999694824219, 125.4000015258789, 132.6999969482422, 142.39999389648438, 153.0, 143.1999969482422, 118.69999694824219, 125.69999694824219, 126.19999694824219, 107.19999694824219, 90.5, 103.19999694824219, 121.30000305175781], [136.6999969482422, 144.3000030517578, 147.6999969482422, 148.8000030517578, 147.10000610351562, 151.1999969482422, 147.5, 149.8000030517578, 155.5, 158.5, 151.0, 135.1999969482422, 126.0999984741211, 127.9000015258789, 127.80000305175781, 127.19999694824219, 122.5999984741211, 129.3000030517578, 131.1999969482422, 130.60000610351562, 134.8000030517578, 140.39999389648438, 149.39999389648438, 148.1999969482422, 138.89999389648438, 108.19999694824219, 101.5999984741211, 112.0, 106.19999694824219, 89.9000015258789, 107.30000305175781, 123.30000305175781], [126.30000305175781, 133.3000030517578, 139.1999969482422, 133.5, 136.60000610351562, 148.6999969482422, 143.60000610351562, 140.39999389648438, 150.5, 159.10000610351562, 149.0, 136.8000030517578, 131.0, 127.5999984741211, 136.6999969482422, 139.5, 128.39999389648438, 128.6999969482422, 128.89999389648438, 130.6999969482422, 124.5, 122.30000305175781, 129.5, 133.5, 126.9000015258789, 105.0999984741211, 104.4000015258789, 116.80000305175781, 113.80000305175781, 93.5, 113.9000015258789, 128.5], [135.60000610351562, 140.1999969482422, 142.60000610351562, 131.0, 146.0, 163.6999969482422, 140.89999389648438, 129.89999389648438, 152.8000030517578, 162.5, 147.3000030517578, 141.3000030517578, 135.39999389648438, 129.39999389648438, 140.5, 150.10000610351562, 143.0, 132.0, 125.19999694824219, 113.9000015258789, 106.4000015258789, 102.9000015258789, 97.80000305175781, 108.5999984741211, 118.5999984741211, 105.5999984741211, 116.0999984741211, 127.4000015258789, 122.69999694824219, 102.4000015258789, 120.30000305175781, 137.10000610351562], [142.8000030517578, 140.10000610351562, 147.39999389648438, 140.39999389648438, 150.89999389648438, 157.8000030517578, 140.89999389648438, 133.5, 144.89999389648438, 147.60000610351562, 140.89999389648438, 139.6999969482422, 123.30000305175781, 114.9000015258789, 123.69999694824219, 129.0, 123.4000015258789, 115.69999694824219, 114.5, 104.5999984741211, 107.9000015258789, 112.5999984741211, 96.0, 102.5999984741211, 109.80000305175781, 97.30000305175781, 115.9000015258789, 127.0999984741211, 118.69999694824219, 105.5999984741211, 119.80000305175781, 134.0], [146.10000610351562, 137.10000610351562, 145.0, 142.39999389648438, 142.60000610351562, 151.89999389648438, 141.5, 127.69999694824219, 134.1999969482422, 139.3000030517578, 143.39999389648438, 144.60000610351562, 125.30000305175781, 118.9000015258789, 109.80000305175781, 99.80000305175781, 98.69999694824219, 106.30000305175781, 102.30000305175781, 103.5999984741211, 116.80000305175781, 130.3000030517578, 114.4000015258789, 104.30000305175781, 97.80000305175781, 85.69999694824219, 100.80000305175781, 109.5, 103.9000015258789, 91.69999694824219, 104.5, 125.69999694824219], [149.3000030517578, 135.89999389648438, 135.5, 132.8000030517578, 138.0, 148.39999389648438, 132.1999969482422, 118.5, 131.0, 142.60000610351562, 141.5, 138.89999389648438, 122.5, 104.5, 92.5999984741211, 90.9000015258789, 96.9000015258789, 106.19999694824219, 97.19999694824219, 105.5, 124.30000305175781, 123.9000015258789, 117.19999694824219, 108.9000015258789, 106.4000015258789, 95.5, 96.9000015258789, 94.19999694824219, 91.0999984741211, 82.9000015258789, 96.80000305175781, 119.0999984741211], [143.60000610351562, 133.10000610351562, 131.39999389648438, 127.0999984741211, 130.8000030517578, 129.39999389648438, 126.80000305175781, 122.30000305175781, 128.10000610351562, 138.1999969482422, 131.1999969482422, 119.4000015258789, 107.0, 99.30000305175781, 85.19999694824219, 81.5, 101.19999694824219, 113.69999694824219, 106.30000305175781, 107.5, 126.0, 125.69999694824219, 119.4000015258789, 107.19999694824219, 98.69999694824219, 98.80000305175781, 101.5, 95.0999984741211, 88.5999984741211, 88.0999984741211, 99.80000305175781, 108.69999694824219], [144.39999389648438, 135.3000030517578, 124.0999984741211, 117.80000305175781, 123.19999694824219, 117.69999694824219, 117.0999984741211, 125.4000015258789, 131.8000030517578, 138.10000610351562, 134.8000030517578, 125.0, 116.5999984741211, 120.30000305175781, 113.69999694824219, 94.9000015258789, 104.30000305175781, 121.4000015258789, 112.80000305175781, 105.19999694824219, 125.0, 134.0, 120.0999984741211, 99.80000305175781, 88.30000305175781, 91.69999694824219, 91.80000305175781, 94.4000015258789, 95.0, 92.4000015258789, 97.4000015258789, 99.80000305175781], [140.60000610351562, 127.9000015258789, 115.9000015258789, 108.69999694824219, 112.0, 111.5, 116.5999984741211, 127.9000015258789, 130.39999389648438, 141.89999389648438, 141.5, 132.6999969482422, 124.19999694824219, 122.0, 121.30000305175781, 109.19999694824219, 113.4000015258789, 124.0, 118.9000015258789, 104.4000015258789, 109.9000015258789, 115.0, 108.69999694824219, 100.5, 92.5999984741211, 91.4000015258789, 82.30000305175781, 89.19999694824219, 100.0999984741211, 100.5999984741211, 97.80000305175781, 99.80000305175781], [134.89999389648438, 125.5999984741211, 123.80000305175781, 116.80000305175781, 113.0, 114.0, 127.0, 132.10000610351562, 135.6999969482422, 140.10000610351562, 131.3000030517578, 132.3000030517578, 130.1999969482422, 126.80000305175781, 117.0999984741211, 107.9000015258789, 123.0999984741211, 131.0, 121.9000015258789, 112.30000305175781, 111.5, 107.0, 111.0, 111.4000015258789, 108.19999694824219, 99.9000015258789, 85.19999694824219, 90.30000305175781, 93.69999694824219, 96.5, 89.80000305175781, 96.5], [131.60000610351562, 128.89999389648438, 130.0, 123.4000015258789, 124.5, 127.19999694824219, 131.6999969482422, 133.6999969482422, 137.6999969482422, 132.3000030517578, 130.1999969482422, 134.1999969482422, 137.3000030517578, 134.1999969482422, 129.10000610351562, 124.4000015258789, 127.30000305175781, 134.10000610351562, 127.80000305175781, 125.69999694824219, 126.0, 121.0999984741211, 116.0, 112.0, 110.80000305175781, 99.19999694824219, 86.30000305175781, 86.19999694824219, 93.80000305175781, 96.5, 91.0999984741211, 101.19999694824219], [126.69999694824219, 128.5, 131.1999969482422, 127.5, 127.69999694824219, 130.1999969482422, 131.60000610351562, 131.89999389648438, 132.8000030517578, 132.3000030517578, 140.5, 139.1999969482422, 137.10000610351562, 129.0, 125.5999984741211, 126.4000015258789, 122.4000015258789, 122.30000305175781, 123.30000305175781, 121.0999984741211, 124.30000305175781, 124.5999984741211, 118.4000015258789, 108.0, 103.80000305175781, 97.5999984741211, 90.80000305175781, 92.5999984741211, 103.4000015258789, 105.69999694824219, 101.30000305175781, 105.5999984741211], [130.0, 133.0, 130.89999389648438, 129.0, 125.5, 125.80000305175781, 124.5, 128.8000030517578, 132.0, 129.5, 130.39999389648438, 130.60000610351562, 128.89999389648438, 119.69999694824219, 109.30000305175781, 114.19999694824219, 120.19999694824219, 118.69999694824219, 117.80000305175781, 110.9000015258789, 114.4000015258789, 116.80000305175781, 115.30000305175781, 108.80000305175781, 104.80000305175781, 104.30000305175781, 98.80000305175781, 100.4000015258789, 106.69999694824219, 108.80000305175781, 101.30000305175781, 101.69999694824219]], [[102.0, 92.80000305175781, 97.5, 103.19999694824219, 105.80000305175781, 113.30000305175781, 124.5999984741211, 127.9000015258789, 123.9000015258789, 114.4000015258789, 107.80000305175781, 108.5999984741211, 111.5, 113.5, 116.80000305175781, 120.69999694824219, 124.69999694824219, 122.19999694824219, 123.5999984741211, 129.1999969482422, 127.0, 123.69999694824219, 120.30000305175781, 118.0, 118.9000015258789, 117.5999984741211, 116.4000015258789, 115.0999984741211, 117.5999984741211, 118.5, 117.4000015258789, 111.0999984741211], [98.80000305175781, 95.0999984741211, 92.69999694824219, 100.5999984741211, 107.0, 113.0999984741211, 122.5999984741211, 124.80000305175781, 124.19999694824219, 120.80000305175781, 120.5999984741211, 121.19999694824219, 117.9000015258789, 114.9000015258789, 118.69999694824219, 126.30000305175781, 129.6999969482422, 128.8000030517578, 130.3000030517578, 134.1999969482422, 127.5999984741211, 122.0, 119.0, 111.5, 113.19999694824219, 114.69999694824219, 112.19999694824219, 116.80000305175781, 119.9000015258789, 121.19999694824219, 115.30000305175781, 112.0], [102.0999984741211, 95.5999984741211, 92.0999984741211, 103.5999984741211, 109.69999694824219, 104.9000015258789, 110.9000015258789, 115.4000015258789, 117.19999694824219, 126.9000015258789, 135.10000610351562, 129.10000610351562, 123.69999694824219, 122.5, 124.0999984741211, 137.1999969482422, 143.8000030517578, 143.60000610351562, 139.89999389648438, 142.89999389648438, 138.60000610351562, 128.1999969482422, 128.89999389648438, 116.80000305175781, 116.19999694824219, 118.69999694824219, 114.69999694824219, 117.69999694824219, 116.0, 116.0999984741211, 114.0, 112.9000015258789], [96.5, 96.30000305175781, 97.5999984741211, 101.5, 107.5999984741211, 110.0999984741211, 108.5999984741211, 108.4000015258789, 111.69999694824219, 121.0999984741211, 121.9000015258789, 113.5, 111.9000015258789, 117.19999694824219, 127.80000305175781, 137.10000610351562, 149.5, 161.0, 159.0, 146.5, 146.39999389648438, 139.8000030517578, 134.39999389648438, 133.0, 130.5, 123.69999694824219, 119.9000015258789, 119.5999984741211, 115.0999984741211, 112.5999984741211, 111.5999984741211, 109.0], [87.69999694824219, 94.0, 98.9000015258789, 101.69999694824219, 102.0999984741211, 111.0, 108.0, 101.5, 101.5, 106.9000015258789, 107.0, 102.9000015258789, 100.5999984741211, 99.9000015258789, 122.9000015258789, 147.39999389648438, 161.60000610351562, 161.1999969482422, 153.10000610351562, 143.10000610351562, 137.39999389648438, 132.1999969482422, 128.60000610351562, 136.1999969482422, 139.60000610351562, 130.10000610351562, 117.0, 114.19999694824219, 109.80000305175781, 107.4000015258789, 106.4000015258789, 106.80000305175781], [94.0, 93.0999984741211, 91.9000015258789, 94.5, 93.4000015258789, 105.30000305175781, 108.80000305175781, 101.4000015258789, 102.5, 109.19999694824219, 108.19999694824219, 109.0, 99.19999694824219, 92.5999984741211, 107.9000015258789, 136.1999969482422, 153.89999389648438, 156.39999389648438, 156.39999389648438, 155.10000610351562, 145.10000610351562, 130.10000610351562, 127.30000305175781, 126.19999694824219, 132.89999389648438, 129.39999389648438, 116.5999984741211, 106.80000305175781, 103.5999984741211, 103.4000015258789, 100.80000305175781, 101.5], [101.30000305175781, 95.4000015258789, 89.9000015258789, 93.19999694824219, 100.4000015258789, 107.4000015258789, 114.4000015258789, 115.69999694824219, 108.19999694824219, 104.19999694824219, 102.4000015258789, 99.30000305175781, 94.9000015258789, 93.4000015258789, 104.9000015258789, 123.4000015258789, 138.89999389648438, 148.6999969482422, 143.6999969482422, 142.0, 138.6999969482422, 125.4000015258789, 121.9000015258789, 112.9000015258789, 127.0999984741211, 135.6999969482422, 129.1999969482422, 115.80000305175781, 112.0999984741211, 115.0999984741211, 111.80000305175781, 109.69999694824219], [104.0999984741211, 93.0999984741211, 85.9000015258789, 103.30000305175781, 103.69999694824219, 100.4000015258789, 101.19999694824219, 107.30000305175781, 103.19999694824219, 97.30000305175781, 99.9000015258789, 93.30000305175781, 90.4000015258789, 93.69999694824219, 104.30000305175781, 123.0, 144.1999969482422, 150.6999969482422, 140.39999389648438, 139.6999969482422, 136.3000030517578, 125.5, 131.6999969482422, 127.5999984741211, 133.1999969482422, 134.8000030517578, 131.89999389648438, 120.30000305175781, 115.5999984741211, 121.69999694824219, 118.30000305175781, 111.5999984741211], [107.9000015258789, 92.5, 84.69999694824219, 98.4000015258789, 98.9000015258789, 97.30000305175781, 101.5, 105.69999694824219, 104.0999984741211, 105.0, 106.69999694824219, 106.9000015258789, 103.9000015258789, 108.5999984741211, 113.0999984741211, 124.0, 143.60000610351562, 153.89999389648438, 147.3000030517578, 149.1999969482422, 127.5999984741211, 104.5, 136.60000610351562, 142.0, 130.39999389648438, 126.5999984741211, 118.5, 107.19999694824219, 90.9000015258789, 98.69999694824219, 101.9000015258789, 100.69999694824219], [100.80000305175781, 94.4000015258789, 96.19999694824219, 107.9000015258789, 108.5, 108.30000305175781, 107.5999984741211, 108.19999694824219, 109.0, 111.0999984741211, 107.4000015258789, 113.0999984741211, 112.5, 113.30000305175781, 113.4000015258789, 124.9000015258789, 139.10000610351562, 147.3000030517578, 148.1999969482422, 146.8000030517578, 124.9000015258789, 105.5999984741211, 129.10000610351562, 137.0, 129.0, 120.30000305175781, 106.4000015258789, 96.4000015258789, 76.69999694824219, 79.5999984741211, 83.0, 84.0], [103.0, 98.5999984741211, 101.5999984741211, 110.19999694824219, 111.4000015258789, 110.0, 108.0999984741211, 110.5999984741211, 116.5, 116.0, 109.5999984741211, 116.0999984741211, 112.9000015258789, 115.69999694824219, 116.4000015258789, 119.30000305175781, 133.0, 138.5, 140.10000610351562, 143.10000610351562, 125.69999694824219, 117.0, 125.19999694824219, 131.1999969482422, 128.89999389648438, 119.0999984741211, 101.0999984741211, 91.9000015258789, 78.69999694824219, 79.4000015258789, 83.80000305175781, 85.0999984741211], [102.0999984741211, 98.0999984741211, 102.69999694824219, 110.0999984741211, 112.19999694824219, 111.9000015258789, 112.5, 110.30000305175781, 115.5, 117.30000305175781, 117.30000305175781, 124.0999984741211, 125.4000015258789, 130.5, 123.9000015258789, 122.0999984741211, 131.6999969482422, 136.89999389648438, 137.1999969482422, 131.89999389648438, 124.5999984741211, 120.0999984741211, 129.1999969482422, 129.8000030517578, 125.5, 121.80000305175781, 112.69999694824219, 104.5, 89.80000305175781, 84.5, 90.80000305175781, 92.0], [102.4000015258789, 102.9000015258789, 99.9000015258789, 101.0, 103.19999694824219, 105.69999694824219, 107.30000305175781, 101.4000015258789, 106.0999984741211, 111.5999984741211, 118.69999694824219, 126.5999984741211, 127.0999984741211, 130.89999389648438, 131.39999389648438, 132.8000030517578, 136.6999969482422, 142.5, 141.3000030517578, 132.3000030517578, 123.5999984741211, 122.9000015258789, 124.0, 125.9000015258789, 127.5999984741211, 122.80000305175781, 116.0999984741211, 113.4000015258789, 101.80000305175781, 88.5, 93.19999694824219, 98.69999694824219], [106.5999984741211, 115.30000305175781, 103.19999694824219, 104.19999694824219, 107.5, 110.69999694824219, 109.9000015258789, 110.0, 105.0, 115.30000305175781, 130.6999969482422, 142.0, 139.39999389648438, 141.1999969482422, 143.89999389648438, 138.6999969482422, 136.1999969482422, 142.10000610351562, 152.1999969482422, 143.89999389648438, 128.8000030517578, 128.6999969482422, 130.6999969482422, 132.1999969482422, 129.10000610351562, 120.5999984741211, 110.0, 109.5999984741211, 108.9000015258789, 100.0, 95.5999984741211, 96.9000015258789], [106.19999694824219, 113.5999984741211, 105.5999984741211, 112.9000015258789, 122.0, 121.30000305175781, 127.4000015258789, 127.9000015258789, 117.19999694824219, 124.30000305175781, 142.0, 149.6999969482422, 146.1999969482422, 147.3000030517578, 143.3000030517578, 139.3000030517578, 143.6999969482422, 139.5, 147.89999389648438, 137.8000030517578, 123.19999694824219, 131.8000030517578, 134.60000610351562, 131.8000030517578, 127.0999984741211, 113.5999984741211, 104.69999694824219, 104.9000015258789, 104.5999984741211, 101.9000015258789, 101.19999694824219, 95.30000305175781], [108.69999694824219, 120.0999984741211, 121.4000015258789, 136.10000610351562, 143.89999389648438, 136.8000030517578, 143.10000610351562, 142.60000610351562, 146.60000610351562, 148.3000030517578, 140.1999969482422, 141.3000030517578, 143.1999969482422, 134.89999389648438, 130.5, 143.5, 145.6999969482422, 144.39999389648438, 136.8000030517578, 132.10000610351562, 121.5, 122.19999694824219, 131.3000030517578, 134.3000030517578, 129.1999969482422, 116.19999694824219, 115.0, 107.5999984741211, 103.5, 103.5999984741211, 103.69999694824219, 102.0], [125.5999984741211, 137.60000610351562, 151.60000610351562, 163.3000030517578, 161.1999969482422, 156.39999389648438, 161.8000030517578, 160.1999969482422, 167.89999389648438, 168.8000030517578, 144.89999389648438, 140.60000610351562, 146.8000030517578, 135.60000610351562, 140.10000610351562, 146.39999389648438, 133.8000030517578, 127.80000305175781, 122.69999694824219, 117.0, 116.5999984741211, 114.19999694824219, 131.5, 151.8000030517578, 143.3000030517578, 129.0, 135.60000610351562, 121.5999984741211, 107.5999984741211, 111.9000015258789, 104.5, 103.5999984741211], [131.8000030517578, 151.89999389648438, 167.1999969482422, 171.60000610351562, 166.6999969482422, 171.5, 168.3000030517578, 164.0, 172.39999389648438, 173.10000610351562, 151.8000030517578, 146.3000030517578, 151.10000610351562, 140.39999389648438, 140.39999389648438, 134.10000610351562, 119.30000305175781, 109.19999694824219, 116.80000305175781, 116.5999984741211, 118.0, 119.19999694824219, 136.6999969482422, 160.5, 148.39999389648438, 130.3000030517578, 141.89999389648438, 136.5, 111.4000015258789, 101.0, 104.0999984741211, 107.80000305175781], [140.10000610351562, 155.89999389648438, 160.10000610351562, 163.5, 164.10000610351562, 167.6999969482422, 159.5, 162.0, 166.3000030517578, 167.39999389648438, 156.5, 150.6999969482422, 142.60000610351562, 141.0, 137.5, 128.1999969482422, 117.5999984741211, 117.0, 121.9000015258789, 125.80000305175781, 128.60000610351562, 135.8000030517578, 144.60000610351562, 154.1999969482422, 145.0, 120.19999694824219, 125.69999694824219, 127.19999694824219, 107.80000305175781, 87.5999984741211, 95.69999694824219, 109.69999694824219], [132.6999969482422, 142.39999389648438, 144.3000030517578, 144.89999389648438, 142.60000610351562, 145.60000610351562, 141.89999389648438, 144.5, 150.10000610351562, 155.3000030517578, 154.3000030517578, 141.6999969482422, 133.8000030517578, 134.1999969482422, 131.89999389648438, 130.3000030517578, 125.19999694824219, 133.10000610351562, 137.1999969482422, 135.8000030517578, 138.89999389648438, 144.60000610351562, 151.60000610351562, 149.5, 142.1999969482422, 112.19999694824219, 101.4000015258789, 107.80000305175781, 99.5999984741211, 81.5, 96.0, 110.5], [122.0999984741211, 131.1999969482422, 136.1999969482422, 130.10000610351562, 131.60000610351562, 142.8000030517578, 138.8000030517578, 136.3000030517578, 147.0, 159.1999969482422, 153.39999389648438, 144.5, 139.5, 135.60000610351562, 142.5, 143.89999389648438, 131.89999389648438, 131.60000610351562, 133.89999389648438, 133.8000030517578, 127.4000015258789, 125.5999984741211, 130.89999389648438, 132.3000030517578, 128.3000030517578, 109.9000015258789, 106.0999984741211, 111.19999694824219, 105.19999694824219, 85.0, 102.80000305175781, 115.69999694824219], [131.39999389648438, 136.60000610351562, 138.6999969482422, 127.80000305175781, 142.39999389648438, 159.5, 137.89999389648438, 126.80000305175781, 150.3000030517578, 163.8000030517578, 151.39999389648438, 149.0, 144.0, 137.5, 147.10000610351562, 156.0, 147.6999969482422, 135.0, 127.80000305175781, 115.0, 107.0, 104.5, 100.19999694824219, 109.0, 119.80000305175781, 109.19999694824219, 115.30000305175781, 118.0999984741211, 111.19999694824219, 92.5, 110.0, 125.80000305175781], [138.89999389648438, 135.60000610351562, 143.6999969482422, 139.89999389648438, 152.1999969482422, 157.6999969482422, 141.10000610351562, 134.0, 145.39999389648438, 148.8000030517578, 142.8000030517578, 144.5, 129.89999389648438, 121.4000015258789, 129.3000030517578, 134.6999969482422, 127.5999984741211, 118.19999694824219, 115.9000015258789, 104.19999694824219, 108.19999694824219, 114.0999984741211, 98.5, 104.0, 110.5999984741211, 97.0, 110.0, 113.4000015258789, 103.9000015258789, 93.5999984741211, 109.0, 123.0], [143.10000610351562, 135.10000610351562, 143.60000610351562, 144.1999969482422, 146.60000610351562, 153.6999969482422, 142.6999969482422, 131.0, 137.0, 139.10000610351562, 142.3000030517578, 145.1999969482422, 128.6999969482422, 123.5, 114.4000015258789, 104.30000305175781, 100.69999694824219, 106.19999694824219, 102.0, 102.0999984741211, 115.9000015258789, 130.0, 112.9000015258789, 101.69999694824219, 94.9000015258789, 81.30000305175781, 90.9000015258789, 94.9000015258789, 89.5999984741211, 79.69999694824219, 93.30000305175781, 113.80000305175781], [149.39999389648438, 136.6999969482422, 134.5, 133.60000610351562, 141.89999389648438, 151.0, 133.60000610351562, 121.0999984741211, 133.0, 140.6999969482422, 139.60000610351562, 139.39999389648438, 126.0999984741211, 107.80000305175781, 94.5, 92.5999984741211, 96.4000015258789, 103.9000015258789, 95.4000015258789, 103.30000305175781, 121.0, 119.5999984741211, 111.19999694824219, 102.0999984741211, 101.30000305175781, 89.5999984741211, 86.0, 81.0999984741211, 79.9000015258789, 73.5999984741211, 86.5, 107.19999694824219], [142.8000030517578, 133.0, 129.0, 125.5, 132.0, 132.39999389648438, 131.1999969482422, 127.0999984741211, 132.0, 138.6999969482422, 131.3000030517578, 121.19999694824219, 108.19999694824219, 99.30000305175781, 84.5, 82.69999694824219, 100.19999694824219, 111.0999984741211, 104.4000015258789, 105.5999984741211, 121.9000015258789, 120.19999694824219, 112.80000305175781, 100.5999984741211, 95.19999694824219, 92.9000015258789, 93.0999984741211, 85.4000015258789, 78.69999694824219, 78.69999694824219, 90.0, 96.4000015258789], [140.0, 132.6999969482422, 121.19999694824219, 115.80000305175781, 121.5, 119.30000305175781, 122.19999694824219, 131.1999969482422, 137.8000030517578, 141.89999389648438, 138.10000610351562, 127.5999984741211, 115.9000015258789, 119.30000305175781, 114.5999984741211, 98.0999984741211, 104.5999984741211, 119.30000305175781, 112.0999984741211, 104.30000305175781, 121.9000015258789, 129.3000030517578, 114.5999984741211, 94.5, 84.5999984741211, 87.0999984741211, 86.80000305175781, 88.19999694824219, 87.5, 83.19999694824219, 87.9000015258789, 88.0999984741211], [136.10000610351562, 125.0, 112.5999984741211, 106.0, 110.19999694824219, 114.5, 121.4000015258789, 133.0, 135.89999389648438, 145.39999389648438, 146.5, 137.5, 124.0999984741211, 121.69999694824219, 123.0, 113.4000015258789, 115.5999984741211, 123.0999984741211, 118.5999984741211, 103.80000305175781, 