{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30000, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "net_40_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "30000", 
        "output_dim": "10", 
        "sparse_grad": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "repeat", 
      "name": "net_40_repeat0_repeat0", 
      "attrs": {
        "axis": "1", 
        "repeats": "91"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "Concat", 
      "name": "net_40_concatenate0_concat0", 
      "attrs": {
        "dim": "2", 
        "num_args": "2"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_dense0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_dense0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(10,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "net_40_dense0_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "10"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "net_40_tanh0_fwd", 
      "attrs": {"act_type": "tanh"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_dense1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(91, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_dense1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(91,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "net_40_dense1_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "91"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_dense2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_dense2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "net_40_dense2_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_dense3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_dense3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "net_40_dense3_fwd", 
      "attrs": {
        "flatten": "False", 
        "no_bias": "False", 
        "num_hidden": "1"
      }, 
      "inputs": [[4, 0, 0], [16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "net_40_swapaxes0_swapaxes0", 
      "attrs": {
        "dim1": "1", 
        "dim2": "2"
      }, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "batch_dot", 
      "name": "net_40_dot0_batch_dot0", 
      "inputs": [[15, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "net_40_gru0_swapaxes0", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_gru0_l0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_40_gru0_reshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_gru0_l0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_40_gru0_reshape1", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_gru0_l0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_40_gru0_reshape2", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_gru0_l0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_40_gru0_reshape3", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[28, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "net_40_gru0__rnn_param_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "4"
      }, 
      "inputs": [[23, 0, 0], [25, 0, 0], [27, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data2", 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "net_40_gru0_rnn0", 
      "attrs": {
        "bidirectional": "False", 
        "lstm_state_clip_max": "None", 
        "lstm_state_clip_min": "None", 
        "lstm_state_clip_nan": "False", 
        "mode": "gru", 
        "num_layers": "1", 
        "p": "0", 
        "projection_size": "None", 
        "state_outputs": "True", 
        "state_size": "10"
      }, 
      "inputs": [[21, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "net_40_gru0_swapaxes1", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_40_dense4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30000, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_40_dense4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30000,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "net_40_dense4_fwd", 
      "attrs": {
        "flatten": "True", 
        "no_bias": "False", 
        "num_hidden": "30000"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0]]
    }, 
    {
      "op": "softmax", 
      "name": "net_40_softmax0_softmax0", 
      "inputs": [[36, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    4, 
    6, 
    7, 
    10, 
    11, 
    13, 
    14, 
    16, 
    17, 
    22, 
    24, 
    26, 
    28, 
    31, 
    34, 
    35
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39
  ], 
  "heads": [[37, 0, 0], [32, 1, 0], [33, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}