{
  "nodes": [
    {
      "op": "null", 
      "name": "data0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "net_00_zscorenormalization0_data_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": [30.75, 30.5, 35.75, 37.83333206176758, 45.66666793823242, 48.16666793823242, 44.83333206176758, 34.41666793823242, 51.5, 50.16666793823242, 41.33333206176758, 37.41666793823242, 40.33333206176758, 23.66666603088379, 21.83333396911621, 33.33333206176758, 26.5, 24.08333396911621, 24.33333396911621, 8.5, 12.833333015441895, 20.25, 12.916666984558105, 24.16666603088379, 21.66666603088379, 14.583333015441895, 25.33333396911621, 18.25, 21.83333396911621, 25.91666603088379, 16.66666603088379, 23.08333396911621, 26.5, 26.75, 18.16666603088379, 17.0, 14.583333015441895, 17.25, 13.833333015441895, 9.833333015441895, 11.833333015441895, 8.833333015441895, 9.166666984558105, 11.916666984558105, 12.0, 2.8333332538604736, 12.083333015441895, 12.166666984558105, 0.1666666716337204, 12.25, 12.333333015441895, 12.416666984558105, 1.3333333730697632, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0]}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(91L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_sub", 
      "name": "net_00_zscorenormalization0_broadcast_sub0", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_zscorenormalization0_data_std", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": [33.96598434448242, 39.93224334716797, 41.79140853881836, 33.87928771972656, 39.266902923583984, 36.58970260620117, 41.026084899902344, 29.660472869873047, 33.31792449951172, 40.6403694152832, 37.74991989135742, 37.706016540527344, 42.67578887939453, 28.087175369262695, 26.05390739440918, 41.14271545410156, 43.36185836791992, 44.807857513427734, 45.21124267578125, 16.99265480041504, 30.1795654296875, 45.280845642089844, 30.668827056884766, 44.560516357421875, 40.37808609008789, 33.54713821411133, 46.858543395996094, 35.147613525390625, 41.3316650390625, 47.72746276855469, 34.9698371887207, 47.211341857910156, 48.702335357666016, 49.11064147949219, 40.399749755859375, 41.056880950927734, 33.87836837768555, 41.4992561340332, 33.120582580566406, 28.13608741760254, 39.24673843383789, 29.29686164855957, 30.40240478515625, 39.52312088012695, 39.79950714111328, 9.397113800048828, 40.07589340209961, 40.35227966308594, 0.55278080701828, 40.628662109375, 40.90504837036133, 41.181434631347656, 4.422176361083984, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06, 9.999999747378752e-06]}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(91L,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "broadcast_div", 
      "name": "net_00_zscorenormalization0_broadcast_div0", 
      "inputs": [[2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_embedding0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30000, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "net_00_embedding0_fwd", 
      "attrs": {
        "dtype": "float32", 
        "input_dim": "30000", 
        "output_dim": "10", 
        "sparse_grad": "False"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "net_00_gru0_swapaxes0", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_l0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape0", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_l0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape1", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_r0_i2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 0)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape2", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_r0_h2h_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30, 10)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape3", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_l0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape4", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_l0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape5", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_r0_i2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape6", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "net_00_gru0_r0_h2h_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(30,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Reshape", 
      "name": "net_00_gru0_reshape7", 
      "attrs": {"shape": "-1"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "_rnn_param_concat", 
      "name": "net_00_gru0__rnn_param_concat0", 
      "attrs": {
        "dim": "0", 
        "num_args": "8"
      }, 
      "inputs": [[9, 0, 0], [11, 0, 0], [13, 0, 0], [15, 0, 0], [17, 0, 0], [19, 0, 0], [21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data1", 
      "inputs": []
    }, 
    {
      "op": "RNN", 
      "name": "net_00_gru0_rnn0", 
      "attrs": {
        "bidirectional": "True", 
        "lstm_state_clip_max": "None", 
        "lstm_state_clip_min": "None", 
        "lstm_state_clip_nan": "False", 
        "mode": "gru", 
        "num_layers": "1", 
        "p": "0", 
        "projection_size": "None", 
        "state_outputs": "True", 
        "state_size": "10"
      }, 
      "inputs": [[7, 0, 0], [24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "SwapAxis", 
      "name": "net_00_gru0_swapaxes1", 
      "attrs": {
        "dim1": "0", 
        "dim2": "1"
      }, 
      "inputs": [[26, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    5, 
    8, 
    10, 
    12, 
    14, 
    16, 
    18, 
    20, 
    22, 
    25
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    28, 
    29
  ], 
  "heads": [[27, 0, 0], [26, 1, 0]], 
  "attrs": {"mxnet_version": ["int", 10400]}
}