{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0, 64, 4, 4)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "conv3_fwd", 
      "attrs": {
        "adj": "(0, 0)", 
        "dilate": "(1, 1)", 
        "kernel": "(4, 4)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0, 32, 4, 4)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "conv4_fwd", 
      "attrs": {
        "adj": "(0, 0)", 
        "dilate": "(1, 1)", 
        "kernel": "(4, 4)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[4, 0, 0], [5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0, 1, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Deconvolution", 
      "name": "conv5_fwd", 
      "attrs": {
        "adj": "(0, 0)", 
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "1", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "sigmoid0_fwd", 
      "attrs": {"act_type": "sigmoid"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "_copy", 
      "name": "identity1", 
      "inputs": [[12, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 5, 6, 9, 10], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14
  ], 
  "heads": [[13, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10800]}
}